{
 "enigmas": [
  {
   "title": "The Intruder",
   "desc": "Emily was sitting at her study table, home alone, on a cold and stormy night. Her parents had taken a flight earlier in the morning to Australia as her grandmother had passed away. She had wanted to follow her parents but she had an important English examination the next day which she could not miss.\nThe storm was getting heavier by the minute and the wind was howling outside. All this noise made it very hard for her to concentrate. She was on the verge of dozing off when she was shaken alert by a sudden \"THUD!\" She dismissed it as a window which had been slammed shut by the wind.\nShe tried to concentrate on her books when she heard faint footsteps. Emily got out of her room and looked around when suddenly, without warning, she was grabbed by the neck. She tried to scream but it came out as a mere whimper as the intruder was pressing hard against her throat with his arm. She tried to free herself from his grip but to no avail.\n\"Give me all your money!\" growled the man who had grabbed her from behind.\n\"Th-there is none h-here! Please ll-let me go!\" cried Emily.\n\"Don't LIE TO ME!\" screamed the increasingly agitated man. She felt the man strengthen his grip around her neck. She said nothing and a few seconds passed by in silence. Suddenly the phone rang which alerted both of them.\n\"People will get suspicious if I don't answer the phone,\" said Emily, with a controlled voice. The intruder let her go.\n\"Alright, but NO funny business, or ELSE!\" said the nervous intruder. Emily walked toward the phone. She took a deep breath and calmed herself. She picked up the phone.\n\"Hey Em! How's the revision going?\" said the caller.\n\"Hey Anna. Thanks for the call. Hey you know those Science notes I lent you last week? Well I really need them back. It would be a great help to me. It's an emergency, so if you could give me them tomorrow it would be great. Please hurry in finding the notes. I need to get back to my books now. Bye,\" Emily said. She hung up the phone.\n\"It was wise of you not to say anything,\" said the intruder, although he was more than a bit confused by her conversation.\n\"Now TELL ME WHERE THE MONEY IS KEPT!\" screamed the thief.\n\"It...it's...in my dad's room. The first room on the right. Third drawer,\" said Emily.\n\"SHOW me!\" said the man, and removed his grip around her neck. She took a big gulp of air and nearly fell. She swallowed hard and said a silent prayer. She walked slowly, in silence, toward her father's room. All of a sudden, they heard police sirens. The intruder froze in his footsteps. He ran to the nearest window and jumped out of it.\nEmily ran outside in time to see the intruder being escorted into the car. She saw Anna and she ran toward her and hugged her.\n\"Smart kids,\" said the policeman.\nWhat had happened?",
   "answer": "Emily had used the mute button during her conversation with Anna so that all Anna heard was: \"call...help...emergency...please hurry\". Anna, sensing something was wrong, called the police and told them Emily's address. The police were able to come to Emily's house in time to catch the perpetrator.",
   "hint": "Read the conversation carefully and think outside the box."
  },
  {
   "title": "A Teacher and Her Stalker",
   "desc": "Detective Drosnin stopped by Ms. Gray's house to inform her that the creep who had been stalking her years ago had just escaped from prison. She seemed to take the news fairly well, and was very polite, though she didn't invite him in.\n\"You know how demented he is, I'm worried that he'll come after you. Who knows what he might try!\" Detective Drosnin said.\n\"Oh, I'm sure I have nothing to worry about,\" she replied. But she did sound pretty nervous.\n\"Would you like me to assign a security detail to you?\" he asked.\n\"Oh, no. I'm a teacher for heaven's sake! Having bodyguards following me around would just scare the students at my school.\"\n\"Well, please give me a call or send me an email if you see anything suspicious at all. In fact, send me an email later no matter what, just to let me know that you're alright.\"\n\"I will definitely do that!\" Ms. Gray replied.\nDetective Drosnin got in his car and started back to the station, but after only a few minutes his phone buzzed to inform him that he had an email from Ms. Gray. It read:\nThis morning I tried a fun new seating style for the kids during the morning assembly. I helped arrange them into rows of twenty one. The kids didn't care, but I really loved it. I liked the second column the best.\n\"Why on earth would I care!?\" he thought to himself. But then he remembered her passion for codes and realized she may be trying to tell him something. He took a closer look at her email, and couldn't believe what he found!\nCan you tell what she was trying to say?",
   "answer": "Detective Drosnin tried arranging the letters in Ms. Gray's email the way she described arranging the kids at her school, into rows of twenty one. Then he took a look at the second column like she suggested:\nt H i s m o r n i n g i t r i e d a f u n\nn E w s e a t i n g s t y l e f o r t h e\nk I d s d u r i n g t h e m o r n i n g a\ns S e m b l y i h e l p e d a r r a n g e\nt H e m i n t o r o w s o f t w e n t y o\nn E t h e k i d s d i d n t c a r e b u t\ni R e a l l y l o v e d i t i l i k e d t\nh E s e c o n d c o l u m n t h e b e s t\nNo wonder she didn't invite him in!",
   "hint": "Detective Drosnin realized that the message was not only in code, it was also the instructions on how to break the code!"
  },
  {
   "title": "Rich Stiff",
   "desc": "\"The town's richest man was killed late last night in a shocking murder,\" the reporter exclaimed from the television across the room. \"Chief Graham tells us that the police are carefully investigating everything and everyone, but they have no lead suspect yet.\"\nChief Graham let out a sigh as he looked out the window at the reporter and the large crowd still gathered outside. \"Isn't there anything better to do in this town than hang around a crime scene all day?\"\n\"No sir,\" answered Detective Jefferson. \"Just the bowling alley, but it's really lame.\"\n\"My nephew runs the bowling alley.\"\n\"That's right, sir! And what a lovely bowling alley it is! Fantastic...pins.\"\n\"Will you just go over the facts with me one more time, detective?\"\n\"Well, we found Mr. Hampton's body in the deep freezer after the mailman, Chuck, called us this morning to report his suspicion that something was wrong. Normally a frozen body would be good news for us. I mean, not GOOD news, may he rest in peace! Not that I'm not happy to finally have a good case to work on! I love my job and all...\"\n\"Get on with it Jefferson.\"\n\"I just mean I'd think a frozen body would be helpful, since freezing preserves the body and the evidence so well. But unfortunately we just can't seem to find any evidence here. He appears to have been hit in the head with a blunt object, but other than that, there's not much we can tell. We've checked the house for clues, but nothing appears to be out of place. Whoever did this was careful. We've interviewed all the people that seem to have any contact with him, his son Don, his daughter Jessica, and of course, Chuck the mailman.\"\n\"I know it's been a long day and we'd all like to go home and get some rest, but I feel like we're missing something. I want to talk to everyone one more time,\" Chief Graham said.\n\"My dad has more money than anyone in this stupid town! Anyone could have a motive to kill him, surely you don't think I did it!\" said Don Hampton with a look of anger and annoyance. \"My dad and I got along fine! When I came over for dinner last month he told me he was proud of me for starting my own business just like he did.\"\n\"Didn't you start your business with a huge loan that he gave you?\"\n\"Well, yeah. But that doesn't mean it wasn't hard!\"\n\"Did you come over often to see him?\" asked detective Jefferson.\n\"Yeah, every couple of weeks or so. Maybe once a month. A couple of times a year. Hey, we'd see each other more often, but you know what a hermit he is. He never leaves the house, so I was the one who had to make all the effort. If you ask me, I deserve a son-of-the-year award!\"\n\"I JUST CAN'T BELIEVE HE'S GONE!\" wailed Jessica Hampton through one of her fits of tears which only seemed to come while she was being questioned. \"HE MEANT SO MUCH TO ME!\"\n\"When was the last time you saw your father?\"\n\"Well, I haven't seen him in a while. But I just talked to him on the phone last Saturday.\"\n\"And he didn't mention anything about being murdered soon?\" Jefferson asked.\nChief Graham sighed. \"Great work, Detective.\"\n\"Thanks chief!\"\n\"Um, no. He sounded fine,\" Jessica continued. \"Look, I'm sure you're thinking I had a motive to kill my father, since I'll probably inherit a lot of money now, but I bet Don will inherit the same amount as me! Plus Don owes - or owed - dad a bunch of money that he borrowed to start his business. So he has a bigger motive than me! HE should be your suspect!\"\n\"Wow, the love in this family is amazing. Let's see what the mailman has to say.\"\n\"I'm used to his mail piling up in the mailbox, since he doesn't like to leave his house, but every now and then I'll have a package for him. Since he does all his shopping online, he's always eager to get his packages, so when I have one he always answers the door!\" Chuck insisted. \"I know it's not much to go on, but when he didn't come to the door this morning, I just had a really bad feeling that something was wrong.\"\n\"Have you noticed anything else lately? Any other suspicious activity?\"\n\"No, not that I can think of. Sorry\"\nThe chief sat down with a sigh. \"This is just great. We have a reclusive victim who hardly ever makes contact with anyone, no clues, plenty of motives, no witnesses, and a lousy detective.\"\n\"Sounds tough, chief!\"\n\"It is, Jefferson. It is.\"\nThe chief was just going to launch into a new stream of complaints, when a thought occurred to him. He stood up suddenly. \"Wait a minute! This may not hold up in court, but I sure know who we should be looking into!\"\n\"You shouldn't end your sentences with a preposition, chief.\"\n\"Jefferson, I will literally kick you in the head.\"\n\"Sorry chief.\"\n\"Someone said something very revealing. I have a hunch that I may just be wrapping up this case sooner than I thought!\"\nWho accidentally alerted Chief Graham to aim the investigation in their direction?",
   "answer": "\"Who has been your source for information on this case?\" Chief Graham asked news reporter Sheila Rivers.\n\"What, do you not remember talking to me? I've gotten all my info from you. Which hasn't been much, I have to say,\" replied Ms. Rivers impatiently.\n\"Right. Have you gotten any more details from anyone else?\"\n\"No, only what you've given me. Why, do you have more for me?\"\n\"Yes. We have a lead suspect. Do you remember what you reported earlier this evening? That the town's richest man was murdered late last night?\"\n\"Of course.\"\n\"How late?\"\n\"Well...Oh. Rats.\"\n\"Rats indeed. The last time anyone had any contact with the victim that we know of was last Saturday, and the time of death is impossible to determine due to Mr. Hampton's body being preserved in the freezer and his tendency to let his mail pile up. So the best estimate we have for the time of the murder is some time between Saturday and this morning when the body was found. But somehow you've determined a much more specific time of death. When I heard you say that...well, a little while after I heard you say that, I realized that either you or your source knows way more than an innocent person should. And now you've told me that it's you! You might as well confess, because let's face it, this story has gone on long enough already.\"\n\"Alright, fine. Do you know how hard it is to be a reporter in this stupid, boring town!? I'm so SICK of having nothing more important to report on than the high school's class president elections, or this year's dog petting contest. It was DRIVING ME CRAZY! I was DYING for a real story! Then I realized...why should I be the one to die?\"",
   "hint": "\"What!? What is it!?\" Detective Jefferson asked.\n\"The mailman said Mr. Hampton's mail often piles up because he rarely leaves the house, right?\"\n\"Yeah.\"\n\"And the last time we have a confirmed contact with the victim was when his daughter spoke with him on the phone last Saturday. And the body is frozen. He's in such good condition, it's hard to say if he's been in there hours, days, or weeks. When would you say this man was killed?\"\n\"How am I supposed to know!? Some time between last Saturday and when the mailman found him this morning.\"\n\"Right. We know more about this case than anyone, and that is the best time-of-death we can come up with...\""
  },
  {
   "title": "Go Ahead, Shoot",
   "desc": "Pirate Pete had been captured by a Spanish general and sentenced to death by his 50-man firing squad.\nPete cringed, as he knew their reputation for being the worst firing squad in the Spanish military. They were such bad shots that they would often all miss their targets and simply maim their victims, leaving them to bleed to death, as the general's tradition was to only allow one shot per man to save on ammunition. The thought of a slow painful death made Pete beg for mercy.\n\"Very well, I have some compassion. You may choose where the men stand when they shoot you and I will add 50 extra men to the squad to ensure someone will at least hit you. Perhaps if they stand closer they will kill you quicker, if you're lucky,\" snickered the general. \"Oh, and just so you don't get any funny ideas, they can't stand more than 20 ft away, they must be facing you, and you must remain tied to the post in the middle of the yard. And to show I'm not totally heartless, if you aren't dead by sundown I'll release you so you can die peacefully outside the compound. I must go now but will return tomorrow and see to it that you are buried in a nice spot, though with 100 men, I doubt there will be much left of you to bury.\"\nAfter giving his instructions the general left. Upon his return the next day, he found that Pete had been set free alive and well. \"How could this be?\" demanded the general. \"It was where Pete had us stand,\" explained the captain of the squad.\nWhere did Pete tell them to stand?",
   "answer": "Pete told them to form a circle around him. All the squad was facing in at Pete, ready to shoot, when they realized that everyone who missed would likely end up shooting another squad member. So no one dared to fire, knowing the risk. Thus at sundown he was released."
  },
  {
   "title": "Haunted House",
   "desc": "Robert, the security guard, drew his gun, took a deep breath, and headed down a shadowy corridor full of plastic cobwebs, fake blood, and recorded screams. It was Robert's worst nightmare, a real-life killer on the loose in Cohan's Haunted House. At least one person was dead, and behind any one of these doors might lie another victim -or worse, the killer - waiting for another victim.\nSomeone somewhere turned off the sound system and switched on the emergency lights. Robert tried the door on the left. Locked. Then the one on the right. Unlocked. He pushed it open two inches, and then it hit something, something that moaned. Robert looked down and saw more blood. Real blood.\nAn hour later and the police had pieced together the basics. A total of two attacks and one murder. Jason Pierce, a 22-year-old employee, had been killed by an ax. Definitely not one of the prop axes, but a real weapon. Alicia Cohan had been luckier. She, too, was bleeding from an ax attack. But when Robert found her, barely conscious behind the door, she was still alive.\n\"It could've been worse,\" Sergeant Greeley told his captain. \"There were just a few employees in the haunted house. The attacker wasn't seen coming into the building, or leaving, for that matter. But he was seen.\" Greeley checked his notepad. \"Medium height, in a ghost costume and a full-head rubber mask. We found the costume, the mask, and the ax not far from the second attack scene. The lab matched the blood samples. Jason's blood and Alicia's blood.\"\n\"Attacker not seen entering or leaving.\" The captain had a way of honing in on the essentials. \"That's strange, given the limited access in that kind of attraction.\"\n\"Yes, sir. I'll interview the second victim, then talk to the others.\"\nAlicia sat up in her hospital bed and spoke with effort. \"We were just opening up. Jason and Millie and Todd were changing into their costumes. Dad was there, too. I turned on the sound system and the mood lights. I was checking the halls for garbage when I heard Todd shouting--something about a crazy person with an ax. A few seconds later, this thing came around the corner. I knew right away.\n\"I don't know why I ran into the dungeon room. There's no other exit. This maniac pushed open the door and started swinging. I fell to the floor, then I must've passed out. I guess he thought I was dead, 'cause the next thing I know, the security guard was waking me up. Was anyone else hurt?\"\nAlicia hadn't yet been told about her boyfriend's death.\nTodd Wilkins seemed more concerned about Alicia than about the death of his best friend. \"She's going to be all right,\" Greeley assured him. \"Just some cuts and bruises. You saw the attack on Jason?\"\n\"Part of it,\" said Todd. \"I was changing into my ghoul costume when I heard something. I went into the next room and there was Jason, fighting off this guy in one of our ghost costumes and an old mask. The guy was swinging this ax, and Jason was trying to grab the ax and swing back. I tried to jump in, but the guy got in one last swing, then ran off down the hall. I shouted out a warning to the others, then went to help Jason. He was bleeding so much.\"\nMillie Miller, like the others, was in her early 20s: short blonde hair, an athletic build and slightly taller than average. \"I was in the locker room downstairs, changing into my witch's uniform. I guess I heard some screaming, but I thought it was the tape. I didn't realize anything was wrong until I came upstairs.\"\nSergeant Greeley nodded, then changed subjects. \"I hear Alicia and Jason were engaged.\"\n\"Engaged? She wishes.\" Millie's laugh died in her throat. \"I shouldn't be mean. Jason and I were together for years, ever since middle school. Things were getting a little stale and too serious, all at the same time. Jason said we should see other people for a while, just to get it out of our systems. That's all Alicia was, a little experiment. He told her that. He was coming back to me.\"\nThis was the third different story Greeley had heard. According to Alicia, they were happy, and Jason had already proposed. According to Todd, Alicia cried on his shoulder all the time. She was sick of Jason and ready to leave. And now Millie's variation on the old, familiar theme.\nThe sergeant caught up with Alicia's father at Cohan's Haunted House. A curious throng stood by the police barricades in front of the boardwalk attraction. \"Thank God Alicia's okay.\" Then he chuckled. \"I can't figure out if this will be good for business or bad.\"\n\"Are you the sole owner?\" Greeley asked.\n\"Alicia and I,\" said the sad-eyed, middle-aged man. \"Alicia has an inheritance from her grandparents. I'm the trustee until she turns 30 or gets married. A chunk of her money went into Cohan's Haunted House. It's a good investment for her.\"\n\"Did you see or hear anything this morning? Anything at all?\"\nCohan shook his head. \"Robert and the kids were all there when I unlocked the doors. I locked up behind them, then went upstairs to the office. They often joked about a real killer getting loose in the haunted house.\"\n\"I'm not surprised.\"\n\"That ghost costume came from a storage closet. And the ax...\"\n\"Was the stairwell fire ax.\"\nCohan sighed. \"It doesn't look like an outsider, does it?\"\nSergeant Greeley agreed. It was an inside job, all right. And he had a good idea which insider it was.",
   "answer": "Alicia Cohan\nAlicia's \"unconscious\" body was too close to the door to allow the killer to exit.\nMillie was right about Jason's state of mind. He had been ready to dump Alicia and return to his old love. But Alicia wasn't ready to let go.\nWhile the others changed clothes, Alicia grabbed the ghost costume and the mask, plus the ax from the stairwell. She attacked Jason, but he fought back, cutting and bruising her in the process. The only way that Alicia could explain away the injuries was to pretend to be a second victim. She discarded the ax and costume, then pretended to be unconscious in the dungeon room.\nHer one mistake? She lay down too close to the room's only door. If a real attacker had been in there, he would have had to move her body in order to squeeze out the door."
  },
  {
   "title": "The Servant's Wish",
   "desc": "Once upon a time, in the West Lake village, a servant lived with his master. After service of about 30 years, his master became ill and was going to die. One day, the master called his servant and asked him for a wish. It could be any wish but just one. The master gave him one day to think about it. The servant became very happy and went to his mother for discussion about the wish. His mother was blind and she asked her son for making a wish for her eye-sight to come back. Then the servant went to his wife. She became very excited and asked for a son as they were childless for many years. After that, the servant went to his father who wanted to be rich and so he asked his son to wish for a lot of money. The next day he went to his master and made one wish through which all the three (mother, father, wife) got what they wanted. You have to tell what the servant asked the master.",
   "answer": "The servant said, \"My mother wants to see her grandson swinging on a swing of gold.\""
  },
  {
   "title": "Sherlock Holmes",
   "desc": "One snowy night, Sherlock Holmes was in his house sitting by a fire. All of a sudden a snowball came crashing through his window, breaking it.\nHolmes got up and looked out the window just in time to see three neighborhood kids who were brothers run around a corner. Their names were John Crimson, Mark Crimson and Paul Crimson.\nThe next day Holmes got a note on his door that read \"? Crimson. He broke your window.\"\nWhich of the three Crimson brothers should Sherlock Holmes question about the incident?",
   "answer": "Mark Crimson\n\"?\" = question MARK, so the note on the door reads \"Question Mark Crimson. He broke your window.\""
  },
  {
   "title": "Duffus & The Snack Game 2",
   "desc": "Duffus loved potato chips almost as much as he loved his tea. The problem was when he had large family gatherings, all the kids would devour his snacks before he could. His marble game worked for a while, but his trick was soon found out. So, Duffus came up with another way to keep the snacks for himself and yet make it seem as though he wasn't the greedy snack hog he was. Duffus took two large bowls, one wood and one plastic, and placed them up high so that the kids couldn't see the contents.\nHe then said, \"One is full and the other is empty. You get whatever is in the bowl you pick. You can pick only once, but you must decipher my clues and explain to me which bowl you think has the chips and why. And no random guessing allowed.\"\nHe then gave them these clues:\n1. The polyester shirt I'm wearing.\n2. A cotton shirt in my closet.\n3. A hollow cardboard toilet paper roll.\n4. This plastic cup I'm drinking my tea from.\n5. The acrylic socks I'm wearing.\n6. An empty paper lunch bag.\nWhat do the clues have in common with each other and the bowls?",
   "answer": "All the kids were stumped except one young girl who gave the correct answer.\nThe items made from synthetic materials (polyester, plastic, acrylic) all have something in them. The items made from natural materials (cotton, cardboard, paper) are all empty. Therefore the plastic bowl (being synthetic) has the chips and the wood bowl (being natural) is empty. Duffus had to hand over the chips and again was left plotting another snack game. But that's another teaser.",
   "hint": "Which items are full & which are empty?"
  },
  {
   "title": "Typing In Riddles",
   "desc": "Detective Larson gazed around the cluttered dingy apartment. The aging famous columnist Max Worthington had been fatally stabbed. His agent, Roger, had called the police when Max failed to submit his column to the newspaper.\nMax's body was draped over his manual typewriter. The detective glanced at the paper in the typewriter. It appeared to be the writer's column. The victim's head rested on the keyboard and had apparently hit random keys causing the last line of the article to be followed by \"49t34 w5qgg3e j3\". The detective was surprised to see that Max had used a typewriter rather than a computer. Roger, Max's agent, explained that Max found it therapeutic to pound the keys on his typewriter, and despised computers.\nOut of a list of acquaintances provided by Max's agent, the detective questioned the following people.\nMarisa had been separated from Max for the last year and a half. Although initially the split had been amicable, lately things had gotten nasty about the latest division of their assets. Max was willing to give Marisa the mansion and a generous lump sum payment, but wanted to draw the line at the excessive alimony being demanded by Marisa's lawyer. Marisa was living in the mansion and had a generous pre-alimony settlement and an extremely attractive new boyfriend.\nJillian was Max's current girlfriend. She definitely was a looker and by all appearances was extremely high maintenance. She was also the spring in this May/December romance. Although crying, she was devastatingly attractive in her designer dress. She had a Gucci bag, wore emerald and diamond jewelry and on her wrist a new Rolex. The detective suspected her grief was for the loss of her \"gravy train\" and not for the deceased.\nMax's brother, Gerald, had been dating Marisa when Max had stolen her away. Gerald still held a grudge and blatantly told the detective that \"he was glad his brother was dead and good riddance\". He hinted that he might try to win Marisa back, now that his brother was dead.\nAfter a brief investigation an arrest was made. Who did the detective arrest?",
   "answer": "The detective arrested Roger, the agent. After looking at the paper in the typewriter, the detective realized that the last line on the news column contained the phrase \"roger stabbed me\". (49t34 w5qgg3e j3) Max had managed to type the message after being stabbed, but his fingers were positioned one line too high on the keyboard, when he typed his final message.\nApparently Max had planned to terminate his association with Roger and in a fit of anger, Roger had stabbed him."
  },
  {
   "title": "Murder In Front of the Bay Window",
   "desc": "Carrie Marshall had recently joined the Riverside police force, and on the first day of her job, she was sent out to investigate a new homicide case. The murder involved a wealthy bachelor, Steven Andrews, who lived in an expensive, grand oceanside mansion. At the time of the murder, there had been five other people in the house: the cook, the maid, two friends, and his niece. Both the cook and maid had rooms in the mansion, and the three guests had all stayed overnight.\nWhen Carrie got to the mansion, the five suspects had all been lined up in front of a large bay window. It was mid-afternoon, and through the window, Carrie could see the beautiful sunset.\nHer partner, Lieutenant Linda Newton, who had arrived an hour earlier, sketched out the details for Carrie. All the suspects had agreed that Steven Andrews had been found murdered in the morning, shortly before six-thirty A.M, but he had been alive a few minutes past midnight, when they all headed to bed. Nobody had heard anything during the night. Mandy Andrews, the niece, had come down to the kitchen to get a glass of water, and on her way back upstairs, had passed the bay window, where she saw her uncle's dead body.\nCarrie decides to begin interrogating the suspects as the lieutenant and two other officers go off to look for more evidence and clues. The suspects give the following testimonies:\nMaid: \"I retired to my room shortly past eleven last night, after cleaning the dining room where Mr. Andrews dined with his guests, and helped the cook put away the leftover food. I was reading a novel until about twelve-twenty, and heard occasional laughter and talk, although I couldn't make out the words. This morning, I heard a scream, which was from Miss Mandy, so I rushed down with the cook and his two friends. Mr. Andrews was laying dead in front of that window. The lieutenant moved his body about fifteen minutes before you arrived, but there was blood on the side of the head, from a gunshot, maybe. I didn't hear anything, but whoever did it could have used a muffler. I'm innocent, though.\"\nCook: \"It's like the maid says. She was cleaning the dining room while I tidied up the kitchen, and we both stored the leftovers in the refrigerator and talked for a few minutes about his guests. I went upstairs and to my room about the same time she did, but fell asleep after I took a shower and brushed my teeth. That was about eleven-thirty maybe, and I slept soundly until this morning, when a scream woke me. I rushed downstairs with the others, and there was the body. I tell you, I didn't do it. I've been with Mr. Andrews for eight years, and he knows he can trust me.\"\nMandy: \"I was up until midnight with my uncle and his friends, talking and joking around. I fell asleep at about one-fifteen, but woke at six-twenty-four, and was thirsty, so I went down to the kitchen to get a glass of water. On the way back, I passed by the bay window, the one behind us, and I could see the beautiful sunrise outside, but, sadly, my uncle was sprawled on the ground, with a huge bloody wound on the side of his head. I screamed and the others were here in just one or two minutes.\"\n\"That's enough,\" Carrie said abruptly, before the two friends of Mr. Andrews can say anything. \"I know who did it. Lieutenant! We have our murderer!\"\nAll five suspects, and the lieutenant and her two men, who came into the room at her call, look at Carrie.\nWho murdered Steven Andrews, and how did Carrie know?",
   "answer": "Mandy killed her uncle. It was afternoon when Carrie looked out the bay window and saw the sunset, so the window must have been facing the west. However, Mandy claimed to have seen the sunrise through that same window, but the sun rises in the east. Carrie learned from a distraught Mandy that they had argued recently, and she had come to settle their dispute, although Steven had already disowned her and refused to re-include her in his will, so, in a fit of anger, Mandy shot him with a revolver hidden in a kitchen cabinet for safety precautions. Her uncle had also fancied a drink and was on his way down to the kitchen when she was taking her glass of water back upstairs.",
   "hint": "The bay window is the key."
  },
  {
   "title": "My Father's Chevy",
   "desc": "My father has, over the years, restored his magnificent 1956 Chevrolet convertible to near perfect condition. Last weekend, he decided to go on a little spin ('twas a warm day, perfect weather for a convertible). As he was pulling out of the driveway, he noticed he was low on gas - the gauge was practically on empty.\nOn his way to the gas station, he made a quick stop at the local fast food restaurant. Having nowhere to park, he reluctantly stopped his car down a side street. As he was leaving, he noticed a few young guys eyeing his vehicle. Thinking nothing of it (it's rare to see this model car in such good condition, so people typically stare), he walked into the food establishment to get himself a deliciously awful burger.\nThe line was long, so it was a while before he returned to where he parked. He returned to his worst nightmare: his car was gone.\nHe hurriedly called the police and reported his Chevy convertible was stolen. He then went back into the restaurant and ordered a half-pounder with bacon, to go.\nAbout 15 minutes later, the police called him back. Apparently, right after he called, the police received a call from a female worker at a gas station about a mile out of town. The worker reported that a beautiful car was left nearby. She said three young men drove up and prepaid for $20 of gas.\nThe three men walked around the vehicle many times, checking under the hood and in the trunk. After a couple minutes of studying the car, the men left without filling up. As they were leaving, the car ran out of gas near the gas station. The men left it there and took off running. The police couldn't think of a reason for the young men paying for gas they didn't use. My father, however, knew exactly what happened.\nThe question is, why would the three men pay for gas they needed but didn't use?",
   "answer": "My father knew that the reason the men didn't fill the car up was simple: they didn't know where to put the gas! In this particular car, the gas tank isn't on either side of the car. It is, however, hidden behind the left taillight. There was a little lever you turned, which revealed the gas tank. That is why the men walked around the vehicle, studying it for a place to insert the nozzle of the gas pump.\n...And yes, my father enjoyed his hamburger.",
   "hint": "The type of car is very important."
  },
  {
   "title": "The Long Tale of the Murdered Heiress",
   "desc": "It was a dark and stormy night in Erisville. Jagged bolts of lightning wracked the sky above Detective Callahan's house. \"Glad I'm not out there tonight,\" Callahan thought. He gazed out his bay window at the thick, frozen fog that had engulfed the landscape. As his yard vanished and was replaced by an eerie, foggy void, Callahan guessed it was maybe five degrees outside right now. Too cold for anything but tea and a book.\nHe took the last gulp of his cup of strong jasmine tea, and headed to the kitchen to make another. His mind was elsewhere as he poured the tea, but a sharp scream jolted him out of his daydream. He jumped, spilling boiling water on his hand, but he hardly noticed.\nHis thoughts were centered on the scream. He waited for another, but no sound came. \"Just a loon,\" he laughed, and went back to his chair, fire and book. His phone rang ten minutes later, making him jump again. It was Murphy, the desk sergeant at the precinct. \"Callahan, we have an apparent homicide at one-two-seven Apple Blossom Rd. Will you check it out since you're so close?\"\n\"Sure,\" the detective replied, stunned by the awful realization the scream he'd heard was not a loon after all.\n\"Thanks,\" said Murphy. \"Officers Gould and Apfel are on the scene now.\"\nCallahan only had to drive around the block to get to the stately home of Celine Omar, heiress to the Omar Tasty Snacks fortune. He drove up the long driveway, passing a small guest house which was about sixty feet from the bigger one. He parked in front of the main house's big bay window and walked inside. He entered the house and was greeted by Gould, who led him into the study with the big bay window he'd parked under. Only the desk lamp was on, giving the room a shadowy appearance. Inside was Apfel, holding an evidence bag containing the murder weapon, a large butcher knife.\nThe body of Ms. Omar was in the middle of the room, covered with a sheet. On the couch sat a woman in a white nightgown, and a man in pajama's, both disheveled and spotted with blood.\n\"What happened here?\" He asked the woman.\nIn a voice choked from tears she said, \"I'm Tessa, the maid. I live in the guest house on the drive and my front window faces this bay window. I heard a scream as I was getting ready for bed. I looked out my front window and saw him struggling with Ms. Omar. I raced in here to stop him, but she was already laying on the floor.\" She began to cry again. \"I tried to pull the knife out and save her but he attacked me too. The whole staff knew he hated her. They were dating up until a month ago, when she broke it off. He seemed fine, but we all knew he would try to get revenge.\"\n\"What?!\" yelled the man sitting next to her. \"She is a liar!\"\n\"Calm down sir,\" said Callahan. \"Why don't you tell me what happened.\"\n\"I am John, the butler. I live in the guest house out back. I heard the scream and ran in the back door. When I got to the study I saw Tessa standing over Ms. Omar's body. I rushed over to Celine, and tried to pull out the knife, to save her, but Tessa attacked me. I loved Celine. I would never hurt her. But Celine had found out that Tessa has been stealing from her. Tessa watches out her front window and spies on Celine in the study. When Celine is occupied, Tessa goes into the house and steals from her. She was about to be fired,\" said John sadly.\n\"Lies!\" screamed Tessa, jumping to her feet.\nApfel took her by the arm. \"You're going to need to calm down ma'am.\" Tessa sat back down, whimpering.\n\"What do you think sir? Both their fingerprints will be on the knife and I've never heard two such conflicting stories,\" said Gould.\nCallahan thought a moment. \"Take Tessa into custody. She's obviously lying.\"\nHow did Callahan come to this conclusion?",
   "answer": "John was telling the truth,\nTessa had to have been lying.\nCallahan had looked out his own window at home and had not been able to see anything through the foggy void. Being only a block away, the conditions would have been the same at Ms. Omar's home. Tessa would not have been able to see into a poorly lit room through 60 feet of frozen fog, making her story impossible.",
   "hint": "Tessa spied every night, but she couldn't have on this night."
  },
  {
   "title": "Safe Crackers",
   "desc": "\"I don't know how to tell you this, but, um, the safe has been robbed. The diamonds are gone.\"\n\"What!?\" The police chief shouted. \"You mean the safe that you've been guarding carefully?\"\n\"That's the one.\"\n\"But we checked every single space in the building in which a human being could possibly hide, it was totally empty. And we had the entire building completely surrounded, and had every possible entrance monitored. So surely we know who did it right? Please tell me we finally caught this guy!\"\n\"Not exactly. By which I mean, no. But we do have it narrowed down to three suspects this time. We tracked the entrance and exit of every person throughout the day, mostly customers of the bank on the first floor, not realizing we had closed it down for the day. Only three people were in the building at the time the safe was robbed. All of them entered separately on foot.\"\n\"Wait, how do you know when the safe was robbed?\" the chief asked.\n\"Well, you know that one car we told you about that was already sitting empty in the parking garage under the building the night before? The one that mysteriously wasn't registered to anyone? Well, all of a sudden it came screaming out of the garage. We probably should have had it towed the night before, huh? Anyway, we all took off after it, but when we finally caught up to it, it was on the side of the road with no one in it. But the felt bag that held the diamonds was under one of the seats.\"\n\"It didn't still have the diamonds in it by any chance, did it?\"\n\"Um, no chief. We all just stood there for a minute, when it suddenly occurred to us that every single one of us left our posts to chase the mystery car, so we all raced back to the building only to find that it was empty. So we're not sure which, if any, of the three suspects was still there when the car took off.\"\n\"Wow. All that training has really paid off.\"\n\"Thanks, chief. So anyway, it's not entirely clear who was involved. But we do know that there are only those three possible suspects. We tracked each one of them down, but none of them had the diamonds on them. They're each in an interrogation room now - Chris Barns, Evan Garrison, and Jimmy Jones. All three of them have at least minor criminal records, and all three are known to be pretty good with a safe.\"\n\"Great. So it could be all of them, or any one of them. What else do we know about them?\" the chief asked.\n\"Well, Chris swore he was going straight several years ago, and he hasn't been suspected of anything since. Although, he has sworn he was going straight several times throughout his criminal career. Evan is known to be a pretty smooth thief, but it's also well known that he's superstitious and refuses to do any job unless his mentor Chris is involved. And then there's Jimmy. He's the best safe-cracker in the business, an absolute legend. People say that, being blind, he has super hearing, so he can hear every movement in the mechanisms of a safe with absolute clarity and precision. He definitely would have been able to get to the diamonds the fastest. But again, either of the other two would also have been able to crack that safe. I don't even know where to start!\"\nThe chief thought for a moment and said, \"Well if everything you've said is true, then I know one of these guys who is definitely guilty. Let's question him and see if we can get him to spill whether either of the other two were involved.\"\nWho is guilty, and how does the chief know?",
   "answer": "Chris is guilty.\nAt least one of the three of them did it. If it was Evan, then Chris is guilty too, since Evan won't work without Chris. If it was Jimmy, then he had to be working with someone else, because he can't drive, being blind. If he was working with Chris, then Chris is guilty, if he was working with Evan, then Chris must have been involved too since Evan won't work without him, so all three would be guilty. If neither Evan nor Jimmy were involved, then Chris would be the only one who could've done it. So no matter what, Chris is guilty."
  },
  {
   "title": "The Galleria Romana Caper",
   "desc": "Private Eye Sam Horowitz sat in his dingy office, watching the paint peel off the walls. He hadn't had a customer all month, and soon he would be out of business if things didn't pick up. That was before she knocked on the door, and entered his office with a flourish. She was a classy dame, looked wealthy too. Her lips were painted bright red, and pearls were sewn on to her red satin dress. Slight of build, standing only five feet tall. As she entered his office, she exuded an aura of desperation.\n\"My name is Erika Von Doran, and I need your help Detective,\" she said as she sat down in the chair facing his desk. \"My father owns the art gallery Galleria Romana, and yesterday we were robbed; all our priceless paintings have been stolen. I am so upset, I haven't slept since last night! The local police are stumped.\"\n\"Two Monet's, four Picasso's, and a Rodin sculpture were stolen. The guard was found taped to a chair at the scene; he claimed that the thieves knocked him out. The janitor was found unconscious on the floor in the office, he claims to remember nothing. Thank goodness we have insurance,\" sobbed Erika.\n\"Well,\" said Horowitz, thinking of the steak and lobsters he would eat when he was done with this case, \"I can help, but my fees are high. I am in quite a demand lately. I will meet you and your father at the scene.\"\n\"Yes, detective, of course! My father will pay anything you ask; I will have him meet you there,\" exclaimed Erika. With that she swept out of his office, her blue eyes sparkling like sapphires with hope.\nWhen he arrived at the Galleria, Erika and her father, a large stately man in a pinstriped suit who stood at least six feet tall, were already there. Horowitz saw as he walked in that the janitor and guard were there too.\n\"Welcome, Detective Horowitz!\" Mr. Von Doran boomed as he strode over to Sam and shook his hand. His grip could have broken Horowitz's hand, he was obviously a man of great strength.\n\"Mr. Von Doran, hello. I will have a look around,\" said Horowitz, trying to subtly remove his hand from the bearish man's grasp.\n\"By all means, Mr. Horowitz. I have gathered the evidence and copies of the police reports for you to look at, and I have called back the staff that was here last night when the robbery occurred. Feel free to talk to them. I hope you can find who did this to our family.\"\nSam was led to scene of the crime. He noted that each painting and the sculpture had been protected in a case behind glass with a lock. The glass had been smashed, and shattered pieces covered the floor. He saw from the police reports that prints of the janitor were found on the cases of all the paintings, and also on what was left of the case that once contained the Rodin sculpture. On the wooden base the sculpture once sat on, there seemed to be crack in the wood, something white was poking out the slightest bit. Horowitz pulled it out with a pair of tweezers. It was a note, which read \"Raucous Elephants Dream, Helping Everyone Realize Romana Is No Good\".\nHorowitz set the note aside, and went back to searching the base with tweezers in hand and his trusty magnifying glass pressed to his eye. Stuck in the crack where the note had been, was a shiny red cloth fiber. Horowitz moved on to the chair where the guard had been, fifty feet from the cases. He examined the pile of duct tape used to secure the guard, and noticed a strange greasy red stain on the torn end of the tape. As he moved on to the police evidence bag, he noticed that a piece of glass was stuck inside the collar of the Blue uniform the guard had been wearing. There was nothing odd about the janitor's green uniform, though.\nHorowitz called to the Von Dorans, the guard and the janitor. When they were gathered around him he said, \"Now, tell me exactly what happened last night.\"\nThe guard, a large man who towered over even Mr. Van Doran, said, \"I was walking by the Picasso, and then some one hit me on the back of the head, and I woke up with the police here and the art was gone.\"\nThe janitor, a stout greasy little man, said, \"I was in the supply closet, when someone put a rag over my mouth, and I lost consciousness.\"\nErika said, \"I was at home when I got the call from Daddy, who said the museum had been robbed.\"\nMr. Von Doran said, \"I was out to sushi with friends when the police called me.\"\nHorowitz then showed them the note left at the base of the statue. \"I think the thief is trying to tell us something,\" he said, \"but clever as this thief is, I have determined who took your painting Mr. Van Doran, and the culprits are in this room!\"",
   "answer": "This teaser was written in the style of old \"pulp\" detective novels with a forensics twist.\nThe janitor cleaned every case in the museum daily, so his prints had reason to be there.\nAfter finding the red fiber and the red smear, Horowitz knew Erika was one of the culprits. She was the only one wearing shiny red clothing, which she has been wearing since the robbery. When she leaned down to place the note in the base of the statue, a thread from her sleeve stuck in the crack. She also didn't think about leaving a red lipstick smear on the duct tape when she ripped a piece off with her teeth after she restrained the guard. However, Erika had to have an accomplice, the guard. The chair he was in was fifty feet away from the glass, yet there was glass on the inside of his collar. This means that he was free and near the glass when it was smashed. He was also much too tall for a five foot tall woman to hit on the head; he had sat in the chair while she secured him with the duct tape.\nFor the meaning of the note take the first letter of each word and put them in a row. They spell RED HERRING, which was a popular term in detective novels meaning a fake clue to lead you off the trail.\n\"It was Erika, and the guard.\" said Horowitz. \"But why, Erika? Why come to my office and ask for my help, if you knew I'd catch you?\"\n\"Alright, I admit it, it was me, and I am in love with a security guard,\" cried Erika. \"If I could sell the art my beloved and I would be able to run away together and be happy. I came to your office Mr. Horowitz, because Daddy was about to hire a good Private Eye. I looked for a Private Eye who had no other business. I thought if I found an incompetent one I could cover my crime. I'm sorry Daddy!\" Erika began to sob.\nSam Horowitz stood there watching her torn between feeling insulted and waiting for a moment to ask about his fee. Insult or no, steak and lobster sounded good tonight.",
   "hint": "Sometimes clues are merely crimson fish."
  },
  {
   "title": "Help By the Beach",
   "desc": "Detective Mick Mace was called to the scene of a beach murder. Two uniformed officers were already there, piecing together the chain of events that lead to the victim's death.\n\"Her name is Jina Lange,\" the first officer tells Mace, \"a 27 year old waitress from 'Jake's Palace.' She was running from someone, but they got her, all right. Knocked her to the ground hard, gashing her head open, and wrapped a belt around her neck. Tried to strangle her to death, but she didn't die when the perp thought she did. She must have crawled 20 feet or so, but she was going toward the water by mistake. When she realized this, she was probably fading in and out of consciousness, and knew she wasn't going to make it. Looks like she wrote the word \"help\" in the sand with her finger, but it has been partially washed away by the approaching tide. See there? The h is half gone already, and the p is missing the stem. We took some pictures for record, though.\"\nMick Mace looked down at the woman who lay dead, shuddering as he thought of what it must be like to die at someone else's hand. What were her last thoughts? What did this woman have to say that someone didn't want the world to hear?\nSuddenly, more cops arrive, with three men in tow. One, they called Jersey, was throwing a fit, his loose pants practically down to his knees in the struggle. \"I wasn't with her! I bought her a drink, but she left without even saying thanks!\" The other, older gentlemen, was the club owner. \"Name's Shelby, detective. She was a great lady. This is a tragedy, but I will do anything to help. I saw her leave the club with that guy right there, but that's all I have.\" He pointed to the third man. \"Yeah, so? She left with me, but only for a sec, to get some smokes from my car. She came right back, honest!\"\nAt that moment, Mace thinks of a very important clue, and knows exactly who is responsible for Jina's death. What does he figure out?",
   "answer": "When Mace saw Jina lying in the sand, he knew she had been aware that she didn't have much time left. So if you wanted help, why not shout out for help? What good does it do to write it in the sand? Wouldn't she much rather finger the person who did this to her? Mace thought so, and so realized that she had not written \"help\" in the sand, she had written \"Shelby\" to finger her killer. However since they found her a bit late, some of the letters had washed away with the waves. Shelby killed her in a fit of rage, when she found out he was stealing money from his own employees at the club.",
   "hint": "Obvious clues don't always point to the answer. Think about it: If you were about to die by murder, wouldn't you want to let someone know who did it? I think Jina would have too. Mace realized this."
  }
 ]
}