{
 "enigmas": [
  {
   "title": "Water in the Cup",
   "desc": "A man in a restaurant asked a waiter for a juice glass, a dinner plate, water, a match, and a lemon wedge. The man poured enough water onto the plate to cover it.\n\"If you can get the water on the plate into this glass without touching or moving this plate, I will give you $100,\" the man said. \"You can use the match and lemon to do this.\"\nA few minutes later, the waiter walked away with $100 in his pocket. How did the waiter get the water into the glass?",
   "answer": "First, the waiter stuck the match into the lemon wedge, so that it would stand straight. Then he lit the match, and put it in the middle of the plate with the lemon. Then, he placed the glass upside-down over the match. As the flame used up the oxygen in the glass, it created a small vacuum, which sucked in the water through the space between the glass and the plate. Thus, the waiter got the water into the glass without touching or moving the plate.\nYou can try this experiment at home with appropriate supervision.",
   "hint": "The glass will be upside-down when the water is in it."
  },
  {
   "title": "Joe Thunder",
   "desc": "As his name would suggest, Joe was not a meek, quiet fellow. In fact he had such difficulty keeping quiet, both his local and university library banned him. His roommate, being a music major and a sound engineer, said he could solve his problem, but Joe would need to trust him. He gave Joe his 75-watt ghetto blaster, a CD, fake mustache, and a long blond wig. Joe, who is sceptical but intrigued, decided to give it a shot. Joe, disguised as one of the professors, entered the university library. He placed the CD player on the table in front of him; loaded the CD; cranked the volume full and braced himself as he turned it on. Surprisingly there was only a very very faint sshh. Joe then realized that he couldn't hear anything at all. He spoke normally, and then yelled, but no one reacted. Awesome, he thought as he began flailing his arms around and shouting as loud as he could. Unfortunately, the librarian, seeing him moving but hearing nothing, assumed he was choking and performed the Heimlich maneuver on him, knocking his wig off, causing the librarian to perform the hind kick maneuver right out the door. Poor Joe.\nBut what had his roommate done? What was on that mysterious CD that made everything quiet?",
   "answer": "Most airline pilots could tell you. Joe's roommate used the same technology that airline and fighter pilots have in their noise cancelling headsets. It works like this; the CD had a low frequency sound (below the 20 Hz which humans can't hear) recorded on it. As long as the volume of the low frequency is louder than your voice or other noise, you hear almost nothing for the low sounds (which humans can't hear) and drown out other sounds. I heard that when this was first discovered that libraries actually used this concept to create quiet until they realized that even though humans couldn't hear the low sound, if loud enough, it would still damage the ears.",
   "hint": "Think sound and what people can and can't hear."
  },
  {
   "title": "Balancing Broom",
   "desc": "If you balanced a broom horizontally on your finger, so that your finger was exactly on the broom's center of gravity, marked that spot and cut the broom in two, then you would have a long and a short piece. The long piece being most of the handle and the short piece being the bristle end and a small part of the handle. Now what will happen if you weigh both pieces? (pick all that apply)\nA) The short piece will weigh more.\nB) The long piece will weigh more.\nC) Both will weigh the same.\nD) Your mom will find out and hit you with both pieces!",
   "answer": "A) The short piece will weigh more!\nThis is due to the torque needed to hold the long piece up. It is the same reason a heavy kid has to sit closer in on a see-saw when he is on it with a lighter friend.\nOh yeah, D) may also be correct depending on your mother's temperament.",
   "hint": "Think about two kids on a see-saw. Where does the heavy kid have to sit to balance the see-saw with his smaller friend?"
  },
  {
   "title": "Venus",
   "desc": "You awake inside a small transparent capsule sitting on the surface of Venus. From a small speaker you hear a voice that says, \"We will leave you here either for a day or a year. If you choose to stay a day, we will give you $1 million. If you choose to stay a year, we will give you $2 million. Either way, you will have sufficient food and water. We will make sure the temperature is a constant 70 degrees Fahrenheit. We will also supply cable TV.\"\nWhat is your choice? (Don't let money decide your answer).",
   "answer": "Choose to stay one year and win $2 million. Venus takes 243 Earth days to rotate on its axis, but it takes 225 Earth days to go around the sun. On Venus a day is longer than a year."
  },
  {
   "title": "An Egg",
   "desc": "A science teacher told his after school class, \"Whoever can get this egg into this smaller glass bottle will win no homework for a week! The rules are: the egg has to go into the bottle in one piece, and you can't break the bottle. You can also use anything in the science lab. So, do we have any volunteers?\"\nA boy raised his hand and the teacher pointed at him. The boy took the egg and looked around the science lab for the things he could use. He saw some writing paper, a pack of matches, some vinegar, a sink, and the glass bottle. By the end of the after school class, the boy had gotten the egg into the smaller bottle.\nHow did he do it?\nNote that, without doing anything to the egg, the egg can't fit into the bottle.",
   "answer": "First, soak the egg in the vinegar which softens the shell without compromising the egg. Next, take some of the writing paper and shred it into pieces. Take the shredded pieces and put them into the glass bottle. Take a match and light a fire inside the bottle with the shredded paper. After, take the vinegar-soaked egg and put it on the top of the bottle so no oxygen can get into the bottle. The fire can't live without any oxygen so it will try to suck oxygen from the entrance which the egg is blocking. When the fire does this, the fire becomes like a vacuum. So, basically, the fire sucks the egg into the bottle to try to get the oxygen. After a short while, the shell will reharden and that's how the egg got into the bottle."
  },
  {
   "title": "Sibling Rivalry",
   "desc": "Swaff is sitting at his desk, being cool, when his younger brother Geemiee walks up. Geemiee had recently been practicing his (fake) magical powers, trying to turn cheese into more cheese, so he believes he can beat Swaff in anything. He sets up a little competition, the first to get 5 ounces of water to freeze, will be proclaimed the coolest guy in their home.\nThey set up some rules, as follows:\n-They both can only use normal water that comes out of their stainless steel faucet.\n-They both use identical containers\n-They both must use the same freezer, at the same time.\nNow, Swaff realizes that if he were to lose, he would become less cool, he just doesn't roll like that. So, how can Swaff have the best chance of winning over Geemiee?",
   "answer": "All Swaff has to do in order to be the winner is use hot water.\nGeemiee, being less cool than Swaff, didn't know that water with a hot average temperature freezes faster than water that is at room temperature. The phenomenon that hot water may freeze faster than cold is often called the Mpemba effect."
  },
  {
   "title": "The Straw that Broke the Champion's Lungs",
   "desc": "A physics teacher used to enjoy tricking his students into learning science facts. One day, he placed an 8-ounce glass filled with water on a table. He then produced 2 straws; one straw he placed into the glass of water and the other he held outside the glass.\n\"Class,\" he said, \"I am willing to fund a pizza party for the class if any one of you can drink this glass of water in 5 minutes using only these two straws.\" The class was amazed; this would be an easy task for any of them. \"There are a few conditions,\" he continued. \"You must drink using both straws at the same time. You must drink using slow and steady draws. You cannot block or obstruct either straw in any way. You cannot lift or tilt the glass off of the table. And finally, one straw must remain outside of the glass.\"\nThe class selected their champion and felt confident that they would be enjoying pizza at the same time next week. Five minutes later, the champion returned to his seat, defeated, and the class sat with jaws agape. Being a good sport, the teacher still bought pizza for the class the next week, confident they would never forget the lesson he taught them.\nWhy did the champion fail?",
   "answer": "The teacher knew a lot about air pressure. He knew that air from a high-pressure area would always seek to fill an area of lower pressure, such as a vacuum. He also knew that a straw worked on this principle. Drawing on the straw creates a low-pressure area in the mouth; air pressure pushes down on the water and forces it up into the straw. When he placed the second straw outside the glass, and thus outside the water, he gave the air a more direct path from the high-pressure area to the low-pressure area. With slow steady draws on the straws, the air will easily rush in through the second straw to fill the low-pressure area, and the water will remain in the glass. Try it at home!"
  },
  {
   "title": "Bamboo Pole",
   "desc": "Doctor Dodge was staying with Cousin Jamie in Jamie's lakeside cabin. They were setting up Jamie's will. As Dodge was Jamie's closest living relative, much of Jamie's estate was being left to him.\nOne day, Jamie went to Dr Dodge very disturbed. \"Doctor,\" he began, \"I have just found out that a man named Georgio wants to get me. He will be here very soon. Where will I go? Where can I hide? If he finds me in here, he will surely kill me. I do not have time to leave this clearing and go farther into the woods.\"\nDr Dodge thought for a moment, and then grabbed a 5' long bamboo pole, with a diameter the size of a quarter. \"Jamie, follow me out to the lake. This lake is 4' deep. If you lie on the bottom of the lake and breathe through this pole, Georgio will never find you. I will be in the bulrushes with a shotgun, and I will shoot him when he comes. I will swim down to find you when he is gone.\"\nJamie consented, and lay down on the bottom of the lake with the bamboo pole in his mouth. A few hours later, a ranger passed by. He found Jamie's body, dead. Dr Dodge told the police of the circumstance, and that Jamie had probably panicked, and died.\nPolice arrested Dr Dodge, on the charges of murdering Jamie. Why?\nThe bamboo pole did not have any cracks or holes. Its opening was above water the whole time.",
   "answer": "Jamie died of carbon dioxide poisoning. The pole was 5' long, but only the size of a quarter.\nThe first time he breathed in, he breathed oxygen. When he exhaled, the air could not travel 5' before he breathed in again. He was just breathing what he exhaled. Before long, all he was breathing was carbon dioxide. He died of CO2 poisoning.\nDoctor Dodge was the one who told him to use the pole, therefore the cause of his death. Dodge is a DOCTOR, and therefore knows about the CO2. Dodge did murder Jamie. His motive: the money in the will.",
   "hint": "Jamie did not drown."
  },
  {
   "title": "Invisible Man",
   "desc": "Cindy, a High School cheerleader, told her fellow cheerleaders that she was worried about changing for practice in their locker room. Seems that she over heard the science teacher, Dr. Smith, telling the Principal that he had just invented an invisibility potion which turns whoever drinks a sip of the potion completely invisible for 24 hours. The bad news was that someone had stolen a bottle of it from Dr. Smith's lab. Cindy was worried that the thief was a guy and that he might already be invisible, hiding in their locker room and waiting to watch them undress. Jane, the Head Cheerleader and President of the Science Club, believed Cindy since she knew Dr. Smith was working on the potion, but told her they had nothing to worry about. Since Jane did not steal the potion or know who had stolen the potion, how could she be so sure their privacy would not be compromised?",
   "answer": "Jane knew that if the potion really did work and could make the thief invisible it would also make him blind while he was invisible. In order to see light needs to be absorbed by our retinas. If a person were completely invisible all light would pass right though them and they would see nothing. If the retinas were somehow able to absorb light then there would be two black spots in the air where they were and they would not be completely invisible. In this case light would then hit the retinas from all angles, since the head would no longer be opaque, and blind the invisible thief. Plus the lenses in the thief's eyes would not work so no image could be focused onto his retinas. Ironically if the thief drank the potion he would never be able to see that he was invisible and unless someone told him he would not even know he was invisible. He would only know that he was blind.",
   "hint": "Jane knows a lot about human anatomy and physics."
  },
  {
   "title": "Charon The Wealth",
   "desc": "Nora Shekrie paid a visit to her niece, Saffa Moore, at Watts-Amata U. One of the first things Nora noticed was a tastefully framed poster over Saffa's desk, apparently a long-range photo of some celestial rock.\n\"Aunt Nora, did you know they just discovered two more moons of Pluto last week?\"\n\"I read about it, but I didn't realize they had posters out already.\"\n\"Oh, this is just a photo some astronomy buff in New Mexico took. He made posters, and he's selling them for $10 each on Uzz-Bay. He included a whole web page on the physical features, especially the impact craters. He says he's working on his PhD. at UNM, y'know, at the Flagstaff campus? That's where Clyde Tombaugh discovered Pluto in the first place.\"\n\"I thought Tombaugh was from Illinois.\"\n\"He grew up in Streator, but he worked at Flagstaff when he found Pluto.\"\n\"Ah. So, what's so great about these craters?\"\n\"Well, there are these elliptical ones in the upper right, pretty much pointing in the same direction, like they're probably all the same age, from one big meteor storm. Then there are a few teardrop-shaped ones here and there, and my favorite is this pair, where two of them make a cute little heart right where the moon's little behind would be. Isn't it darling?\"\n\"It sure is. But I really think your parents should have a talk with a few people.\"\n\"Because I'm so excited about astronomy?\"\n\"Because you're not learning enough to know when you're being cheated.\"\nHow did Nora know?",
   "answer": "\"Saffa, this is a nice piece of graphic work, but it's fake. First and foremost, impact craters are round. Regardless of the angle or speed of impact, anything going that fast leaves a circular crater.\"\n\"No way!\"\n\"Yes way! Try it with marbles or candy in a tray of flour, or a sandbox, whatever you like. That's why lunar craters are circular.\"\n\"But he's getting a PhD. in astronomy!\"\n\"His web site says that, but I doubt it. The Lowell Observatory is in Flagstaff ... which is in Arizona, not New Mexico.\"\n\"But what about my $10?\"\n\"I leave that as an exercise for the student.\"",
   "hint": "Look at a map of the Moon."
  },
  {
   "title": "Cork in a Glass",
   "desc": "If a cork is put into a glass of water, the cork will almost always drift to the side of the glass. There is one simple way, however, to get the cork to float in the center of the glass (the horizontal center, not the vertical). What is it? Water, the glass, and the cork are all that is required.",
   "answer": "The reason that a cork drifts to the side of a glass is that it floats to the highest point. Since water \"clings\" to the glass, the highest point is around the edge of the water. To get the cork to float in the middle of the glass, all you have to do is fill the glass as much as possible. The water will form a convex shape above the glass, with the highest point at its center. This is where the cork will settle."
  },
  {
   "title": "Eggsactly What Happened",
   "desc": "Sam Rottenegger got some free tickets to go and see his least favorite band. Sam, feeling a little unruly, stopped at the corner store so he could bring a 1/2 dozen eggs with him to the concert. The concert was packed and the tunes were so loud that Sam could hardly stand it. He started making his way through the crowd when one of the eggs broke in his pocket and ran down the inside of his shirt. Sam squirmed with disgust but thought how great it would be to see that yellow ooze on the band members. It took him 60 grueling minutes to make his way close enough to launch his attack. Sam chucked one right at the bass player but it just bounced off him without breaking. \"Odd,\" Sam thought, but every one of the 4 eggs he threw just landed unbroken. He never got to throw the 5th as security removed Sam promptly. Sam, now half deaf, bruised, battered, and confused looked closely at the egg and noticed it wasn't exactly raw anymore. Frustrated, Sam chucked the egg over his shoulder hitting an Officer who gladly gave him a free nights stay at the Bars Inn.\nSo what happened to the eggs that caused them not to break? Note that they were totally raw when he brought them in .",
   "answer": "High volume sound waves at certain frequencies can cause the proteins in an egg to stick together almost like when it is boiled. Thus the eggs bounced like a hard boiled egg instead of breaking.",
   "hint": "Remember Sam was almost deaf at the end of the concert."
  },
  {
   "title": "Cut 'n' Paste",
   "desc": "This one is a \"mental\" exercise - don't use paper and scissors - just imagine in your mind:\nTake a sheet of paper - any size that you happened to have (remember, just imagine this paper). Now fold this sheet of paper in half and now fold it in half again, at right angles to the first fold. Now you have four thicknesses of paper. Now imagine you use scissors and cut through all four thicknesses, right down the middle of the paper, parallel to the first fold you made. Now, imagine, how many pieces of paper do you have now? Don't get paper and scissors to solve this one - try to picture this in your mind!",
   "answer": "You will have 3 pieces of paper after the cut. It won't matter which direction you make the cut with the scissors - you'll end up with 3 pieces of paper. Don't believe it? Now go get the paper and scissors and actually do this - you'll see!"
  },
  {
   "title": "Close Shave",
   "desc": "Homer had suffered a bizarre accident that affected his eyesight. The doctor said it would be temporary, but for the next 4 weeks, he had to adjust how he did some things. The accident had affected his focal length. He was only able to focus on objects that were 6 or more feet away from him, anything closer than 6 feet was just a blur.\nHomer was used to shaving up close in front of his bathroom mirror. Now after the accident, how close could Homer get to the mirror to see his face clearly enough to shave?",
   "answer": "3 feet\nYour focal length in a mirror is your distance away from the mirror, plus the distance of the object away from the mirror. When you look at an object in a mirror, you are seeing a virtual image the exact distance it is away from the mirror. So, if you are standing 3 feet away from a mirror, and focus on your face, you are actually focusing at 6 feet.\nTo try this out, put a piece of tape on a mirror, about eye level. Standing in front of the mirror, focus your eyes on the tape, now your face is out of focus. Focus now on your face, and the tape is out of focus."
  },
  {
   "title": "Cork in Bucket",
   "desc": "A cork, say from a wine bottle, is held by a robotic clamp at the bottom of a bucket of water and released the moment the bucket is dropped off the side of a tall building. What will happen to the cork during the fall? Will it float to the top of the bucket normally, slower than normal, faster than normal, or not at all?\nAssume that there is no air resistance to slow the bucket down.",
   "answer": "The cork will stay at the bottom of the bucket and not float up at all during the fall, since the cork, the bucket and the water all fall at the same acceleration g (neglecting air resistance as all good physics questions do). The buoyant force of the water does not push the cork upward in this case since in free fall the buoyant force is zero. In other words, a cork only floats up when the water around it is heavier and pushes it up. In free fall the water is weightless, as is the cork and bucket, so there is no force to push the cork to the top of the bucket.",
   "hint": "Think about why the cork would float to the surface of the water when the bucket is not falling."
  }
 ]
}