{
 "enigmas": [
  {
   "title": "What is Risk?",
   "desc": "There was once a college that offered a class on probability applied to the real world.\nThe class was relatively easy, but there was a catch. There were no homework assignments or tests, but there was a final exam that would have only one question on it.\nWhen everyone received the test it was a blank sheet of paper with a solitary question on it: \"What is risk?\"\nMost students were able to pass, but only one student received 100% for the class! Even stranger was that he only wrote down one word!\nWhat did he write?",
   "answer": "The brilliant student wrote down:\n\"This.\"\nAnd handed in the paper.\nBy doing this, the student demonstrated that he understood that having your grade based on one exam is risky.\nPlus, putting just one word on such an important exam and hoping the professor understands what he means is risky in and of itself!",
   "hint": "What the student wrote showed the professor that he had a good understanding of the material, thus the A."
  },
  {
   "title": "Birbal the Wise - XIV",
   "desc": "Emperor Akbar once ruled over India. He was a wise and intelligent ruler, and he had in his court the Nine Gems, his nine advisors, who were each known for a particular skill. One of these Gems was Birbal, known for his wit and wisdom. The story below is one of the examples of his wit. Do you have it in you to find out the answer?\nA farmer and his neighbour once went to Emperor Akbar's court with a complaint.\n\"Your Majesty, I bought a well from him,\" said the farmer pointing to his neighbour, \"and now he wants me to pay for the water.\"\n\"That's right, your Majesty,\" said the neighbour. \"I sold him the well but not the water!\"\nThe Emperor asked Birbal to settle the dispute.\nHow did Birbal solve the dispute?",
   "answer": "\"Didn't you say that you sold your well to this farmer?\" Birbal asked the neighbour. \"So, the well belongs to him now, but you have kept your water in his well. Is that right? Well, in that case you will have to pay him a rent or take your water out at once.\"\nThe neighbour realized that he was outwitted. He quickly apologised and gave up his claim."
  },
  {
   "title": "The Psychic Hobo",
   "desc": "One day, I was waiting to get on the subway. I was eating the apple I always have for breakfast, and I decided to sit next to a homeless man on the bench. While waiting, we saw a fat man walk by us. The hobo then muttered, \"Pig.\"\nI didn't give it a second thought, except that the comment was rude. There were still a few minutes until the next subway train arrived, and another man walked past us. He was tall, wearing a business suit. As he walked past, the hobo said, \"Human.\" I thought nothing of this remark, other than he was, obviously, a human. The subway finally arrived, and I left for work.\nThe next day, the hobo was still there at the subway station. Today I watched from a distance. Several people walked past him; a skinny woman, a muscular man, and an old lady. In turn he muttered, \"Soup,\" \"Pork,\" and \"Cookie.\"\nOdd labels, I thought, because obviously none of them was a cookie. I got on the subway again, and proceeded to work. I could not stop thinking about the odd man at the subway station.\nI observed him for days to come, and he continued this odd behavior. He would call people bread, carrot, rabbit, milk, and other strange things.\nThe next day, I walked by the homeless man once again, and he silently muttered, \"Apple.\"\nAt that point, I finally recognised what was going on. Then, remembering something, I was stricken with horror.\nWhat was the hobo's ability, and why was I horrified?",
   "answer": "He was able to tell what people last ate. I told you in the beginning of the teaser that I ate an apple every day before work, and at the end he said \"Apple\" to me.\nThe reason I was horrified was because the first day I saw him, he had said \"Human\" to somebody, implying that they were a cannibal.",
   "hint": "I wonder what I'm going to eat for breakfast..."
  },
  {
   "title": "Birbal The Wise - XVIII",
   "desc": "Emperor Akbar once ruled over India. He was a wise and intelligent ruler; and he had in his court the Nine Gems, his nine advisors, who were each known for a particular skill. One of these Gems was Birbal, known for his wit and wisdom. The story below is one of the examples of his wit. Do you have it in you to find the answer?\nOne day, Emperor Akbar posed a question to Birbal. He asked him what Birbal would choose if he offered either justice or a gold coin.\n\"The gold coin,\" said Birbal without hesitation.\nOn hearing this, Akbar was taken aback. \"You would prefer a gold coin to justice?\" he asked, not believing his own ears.\n\"Yes,\" said Birbal.\nThe other courtiers were amazed by Birbal's display of idiocy. They were full of glee that Birbal had finally managed himself to do what these courtiers had not been able to do for a long time - discredit Birbal in the emperor's eyes!\n\"I would have been disappointed if this was the choice made even by my lowliest of servants,\" continued the emperor. \"But coming from you it's not only disappointing, but shocking and sad. I did not know you were so debased!\"\nHow did Birbal justify his answer to the enraged and hurt Emperor?",
   "answer": "\"One asks for what one does not have, Your Majesty.\" said Birbal, smiling gently and in quiet tones.\n\"Under Your Majesty's rule, justice is available to everybody. But I am a spendthrift and always short of money and therefore I said I would choose the gold coin.\"\nThe answer immensely pleased the emperor and respect for Birbal was once again restored in the emperor's eyes."
  },
  {
   "title": "Birbal The Wise - XIX",
   "desc": "Emperor Akbar once ruled over India. He was a wise and intelligent ruler; and he had in his court the Nine Gems, his nine advisors, who were each known for a particular skill. One of these Gems was Birbal, known for his wit and wisdom. The story below is one of the examples of his wit. Do you have it in you to find the answer?\nOne day the Emperor Akbar stumbled on a small rock in the royal gardens and momentarily went off balance. He was in a bad mood that day and the incident only served to make him more angry.\nFinding a target for his mood of the day, he ordered the gardener's arrest and execution.\nBirbal heard of this and visited the gardener in the cell where he was being held awaiting execution. Birbal had known the gardener for many years and also knew of the gardener's immense respect and sense of loyalty for the king. He decided to help the gardener escape the death sentence and explained his plan to the gardener, who reluctantly agreed to go along.\nThe next day the gardener was asked what his last wish was before he was hanged, as was custom. The gardener requested an audience with the emperor. This wish was granted, but when the man neared the throne he tried to attack the emperor.\nThe emperor was shocked and demanded an explanation. The gardener looked at Birbal, who stepped forward and explained why the gardener had attacked the emperor.\nThe emperor immediately realised how unjust he had been and ordered the release of the gardener. How did Birbal manage this?",
   "answer": "\"Your Majesty,\" said Birbal, \"there is probably no person more loyal to you than this unfortunate gardener. Fearing that people would say you hanged him for a silly reason and question your sense of justice, he went out of his way to give you a genuine reason for hanging him.\""
  },
  {
   "title": "A Truly Gifted Teacher?",
   "desc": "Last week, the local Primary school was visited by the Government School Inspector who was there to check that teachers were performing well in their respective classes.\nHe was very impressed with one particular teacher. The Inspector noticed that each time the class teacher asked a question, every child in the class put up their hands enthusiastically to answer it.\nMore surprisingly, whilst the teacher chose a different child to answer the questions each time, the answers were always correct.\nWhy would this be?",
   "answer": "The children were instructed to ALL raise their hands whenever a question was asked. It did not matter whether they knew the answer or not.\nIf they did not know the answer, however, they would raise their LEFT hand.\nIf they knew the answer, they would raise their RIGHT hand.\nThe class teacher would choose a different child each time, but always the ones who had their RIGHT hand raised.",
   "hint": "1. The class teacher asked many questions.\n2. All the children were normal kids and all of them raised their hands.\n3. The children were not prompted beforehand with the questions or answers.\n4. Not all the children knew the answers, but they still put up their hands."
  },
  {
   "title": "Birbal The Wise - XVII",
   "desc": "Emperor Akbar once ruled over India. He was a wise and intelligent ruler; and he had in his court the Nine Gems, his nine advisors, who were each known for a particular skill. One of these Gems was Birbal, known for his wit and wisdom. The story below is one of the examples of his wit. Do you have it in you to find the answer?\nOnce, Birbal was invited to Persia by the Persian king. He was honoured with celebrations in his honour and many presents and gifts were heaped on him.\nAfter a few days of revelry and enjoyment, it was time to head back home. On the eve of his departure, a nobleman of Persia asked him how he would describe the king of Persia in comparison to his own king.\n\"Your king is the full moon,\" said Birbal. \"Whereas mine is like the quarter moon.\"\nThe Persians were very happy with this answer and sent Birbal off with great pomp and gaiety.\nBut when Birbal got home, he found that Emperor Akbar was furious. It was obvious that information about his \"praise\" of the Persian king had preceded his own arrival.\n\"How could you belittle your own king?\" demanded a furious Emperor Akbar. \"You are a traitor!\"\nBirbal objected to this and said that he had, in fact, praised his own king! How did Birbal explain this to the king?",
   "answer": "\"No, Your Majesty,\" said Birbal. \"I did not belittle you. The full moon diminishes and ultimately disappears whereas the quarter moon grows from strength to strength. What I, in fact, proclaimed to the world is that your power is growing from day to day whereas that of the king of Persia is declining.\"\nAkbar was overjoyed at this answer and welcomed Birbal back with a royal embrace and a celebration in his honour."
  },
  {
   "title": "Do Not Tap on the Glass.",
   "desc": "A man works at an aquarium. Every day he spends a large chunk of his time trying to stop people from tapping on the glass at the shark tank. Finally, fed up with it, he comes up with a solution. The solution works perfectly; the next day no one taps on the glass. However, he is fired for it. What was the man's solution?",
   "answer": "The man painted a crack on the glass. Fearing it would break, no one touched it. However, since it made the aquarium seem unsafe and it scared the patrons, he was fired.",
   "hint": "The plan took some effort to do and not everyone could accomplish it."
  },
  {
   "title": "After Dinner Car Troubles",
   "desc": "This teaser is based on a weird but true story from a few years ago.\nA complaint was received by the president of a major car company:\n\"This is the fourth time I have written you, and I don't blame you for not answering me because I must sound crazy, but it is a\nfact that we have a tradition in our family of having ice cream for dessert after dinner each night. Every night after we've eaten, the family votes on which flavor of ice cream we should have and I drive down to the store to get it. I recently purchased a new Pantsmobile from your company and since then my trips to the store have created a problem. You see, every time I buy vanilla ice cream my car won't\nstart. If I get any other kind of ice cream the car starts just fine. I want you to know I'm serious about this question, no matter\nhow silly it sounds: 'What is there about a Pantsmobile that makes it not start when I get vanilla ice cream, and easy to start whenever I get any other kind?'\"\nThe Pantsmobile company President was understandably skeptical about the letter, but he sent an engineer to check it out anyway. He had arranged to meet the man just after dinner time, so the two hopped into the car and drove to the grocery store. The man bought vanilla ice cream that night and, sure enough, after they came back to the car it wouldn't start for several minutes.\nThe engineer returned for three more nights. The first night, the man got chocolate. The car started right away. The second night, he got strawberry and again the car started right up. The third night he bought vanilla and the car failed to start.\nThere was a logical reason why the man's car wouldn't start when he bought vanilla ice cream. What was it?\n(The hint may prove helpful)",
   "answer": "Vanilla ice cream was the most popular flavor and was on display in a little case near the express check out, while the other flavors were in the back of the store and took more time to select and check out. This mattered because the man's car was experiencing vapor lock, which is excess heat boiling the fuel in the fuel line and the resulting air bubbles blocking the flow of fuel until the car has enough time to cool. When the car was running there was enough pressure to move the bubbles along, but not when the car was trying to start.\nMoral of the story: Sometimes even insane sounding problems are real. A better moral: Chocolate ice cream cures vapor lock.",
   "hint": "The man lived in an extremely hot city, and this took place during the summer. Also, the layout of the grocery store was such that it took the man less time to buy vanilla ice cream."
  },
  {
   "title": "Fake Out",
   "desc": "Joesph walked Chuck, a potential new employee, through his company. He briefly went over the safety precautions of a couple machines, their uses, and regular day-to-day activity. Joseph was very impressed with Chuck's qualifications and knowledge on the workings of his business. Chuck was applying for a position in shipping. Joseph took him by the wall where a single dollar hung up. He proudly explained that it was the first dollar he ever made, almost 20 years ago, when the business first started. Finally Joseph brought the man outside and showed him his parking spot. Chuck thanked Joseph for the tour, but then directed Joseph to put his hands over his head.\nWhat happened?",
   "answer": "Joseph was a counterfeiter, and Chuck was an undercover police officer. Joseph's business was to create counterfeit bills.\nChuck finally had the evidence to arrest Joseph when he showed him \"the first dollar he ever MADE\".",
   "hint": "One word is more important than the others."
  },
  {
   "title": "Birbal the Wise - XIII",
   "desc": "Emperor Akbar once ruled over India. He was a wise and intelligent ruler, and he had in his court the Nine Gems, his nine advisors, who were each known for a particular skill. One of these Gems was Birbal, known for his wit and wisdom. The story below is one of the examples of his wit. Do you have it in you to find out the answer?\nOne day, a dishonest, one-eyed man wanted to punish Birbal. He accused him of stealing his 24 karat gold necklace and reported this theft to the police. The case was brought to the high court where the judge knew Birbal very well, and he also knew that he was not a thief. So, he asked the man, \"What makes you think that Birbal stole your necklace?\"\n\"Your Honor, with my own one eye, I saw him stealing the necklace,\" the man swiftly replied. Then he stated, \"If he is innocent, let him prove it. Allow me to bring a hot iron, and if he can hold it in his bare hands, then I will be satisfied that he didn't take my necklace and isn't lying to me.\"\nA confused Birbal said, \"You mean that if I'm telling the truth, I will not burn my hands with that red hot iron?\"\n\"Of course not! God will then protect you,\" the man strongly declared in front of a nodding crowd.\nIt would seem as if Birbal couldn't do anything but hold the red hot iron which would undoubtedly burn him whether he was telling the truth or lying. However, he came up with another one of his witty replies on the spot.\nCan you guess what he said?",
   "answer": "Calmly, Birbal stated, \"I am ready for that, if you believe that I will not be burnt, but the same should apply to you also. If you aren't lying, the hot iron should not burn your hands either. So, you can kindly bring that red hot iron, holding it in both of your hands, and then give it to me to hold it.\"\nThe speechless man quickly told the judge he would search in his house again, bowed, left, and never lied against Birbal again."
  },
  {
   "title": "The Diamond",
   "desc": "A rich old lady died and left all her money to her grandchildren and her children. At the end of the will she stated that she had one last thing to give away: her precious diamond. She gave a clue to where it might be. She said \"it's in a cylinder surrounded by a thousand squares.\" One grandchild said, \"I know where it is,\" and found it. Where was it?",
   "answer": "In a roll of toilet paper."
  },
  {
   "title": "For the Smell of Soup",
   "desc": "A beggar was given a piece of bread, but nothing to put on it. Hoping to get something to go with his bread, he went to a nearby inn and asked for a handout. The innkeeper turned him away with nothing, but the beggar sneaked around to the kitchen window where he saw a large pot of soup cooking over the fire. He held his piece of bread through the window and over the steaming pot, hoping to thus capture a bit of flavor from the good-smelling vapor.\nSuddenly the innkeeper seized him by the arm and accused him of stealing soup.\n\"I took no soup,\" said the beggar. \"I was only smelling the vapor.\"\n\"Then you must pay for the smell,\" answered the innkeeper.\nThe poor beggar had no money, so the angry innkeeper called for the magistrate.\nNow at that time an elder knight named Chistpin was serving as magistrate, as most able bodied men were with the Baron in the Holy Land on yet another crusade, and came over and heard the innkeeper's complaint and the beggar's explanation.\n\"So you demand payment for the smell of your soup?\" summarized Chistpin after listening to both men.\n\"Yes my lord!\" insisted the innkeeper. \"My soup is good and it is costly to make, so the rich smells must also be costly and have a value too.\"\n\"Payment for the smell? Indeed all things have value, but what would be a fair value for just the smell of a pot of soup? That is the problem here.\"\nJust then something behind him caught Sir Chistpin's attention as a customer paid for his ale and was leaving. \"Ah, yes. Yes indeed, there is a fair payment for just the smell of your soup\".\nHow could there be a fair value for just the smell of cooking soup?",
   "answer": "The elder knight looked at both the beggar and the innkeeper, and then back to where the sound of a coin, tossed on a table as a customer paid for his ale and left, had caught his attention.\n\"Innkeeper, I, Sir Chistpin, acting magistrate of Lincolnshire, have found a just and fair payment for the smell of your soup, and I will pay it to you myself,\" said Chistpin. Taking two large gold coins from a small leather pouch, the Innkeeper's eye sparkled, and Chistpin said, \"I will pay for the rich smell of your costly soup with the rich sound of money.\" Thus Sir Chistpin rang the two coins together loudly, and then he put them back into his pouch; with the price of justice paid, sent the beggar on his own way and left the innkeeper to his own means.",
   "hint": "Would the value be less for bad cooking?"
  },
  {
   "title": "What Happened?",
   "desc": "Tom and his wife went to a local club to have dinner and see a show. They had been eating their meal and watching the show when Tom started losing voluntary control over most of his body. His legs, arms, back and chest became tense. His facial muscles squeezed upwards. His stomach muscles and diaphragm began to spasm. His heart began to race and his blood pressure rose quickly. Yet nobody did anything for him and no medical attention was given. Why not?",
   "answer": "He and his wife were at a comedy club and the symptoms are the description of what happens to someone who is laughing.",
   "hint": "What kind of club was it?\nWere others experiencing the same?"
  },
  {
   "title": "Cupcakes For Sale!",
   "desc": "Two boys were sent by their mothers to sell an equal amount of cupcakes each, worth one dollar per cupcake.\nThey were told not to eat the cupcakes they are selling, and that they should sell all of the cupcakes.\nAt the end of the day, all cupcakes were sold, yet neither boy gained nor lost a dollar.\nWhat happened?",
   "answer": "Each boy became hungry after a while. One boy decided to buy a cupcake from the other boy, paying him one dollar.\nThe other boy also decided to buy a cupcake from the first boy, paying him one dollar, too.\nAnd so it continued until all the cupcakes were sold, and both boys came home full and happy.\nI can't say the same for the moms, though.",
   "hint": "The boys were obedient and did sell all the cupcakes. However, they ARE human..."
  }
 ]
}