{
 "enigmas": [
  {
   "title": "Should You Be Institutionalized?",
   "desc": "It doesn't hurt to take a hard look at yourself from time to time. This little test should help you get started.\nDuring a visit to a mental asylum, a visitor asked the Director what the criteria is that defines if a patient should be institutionalized.\n\"Well,\" said the Director, \"we fill up a bathtub. Then we offer a teaspoon, a teacup, and a bucket to the patient and ask the patient to empty the bathtub.\"\nOkay, here's your test:\n1. Would you use the spoon?\n2. Would you use the teacup?\n3. Would you use the bucket?\n\"Oh, I understand,\" said the visitor. \"A normal person would choose the bucket, as it is larger than the spoon.\"\nWhat was the director's response?",
   "answer": "\"No,\" answered the Director. \"A normal person would pull the plug.\"\nSo, how did *YOU* do?"
  },
  {
   "title": "Greatest Area",
   "desc": "A farmer challenges an engineer, a physicist, and a mathematician to fence off the largest amount of area using the least amount of fence.\nThe engineer made his fence in a circle and said it was the most efficient.\nThe physicist made a long line and said that the length was infinite. Then he said that fencing half of the Earth was the best.\nThe mathematician laughed at the others and with his design, beat the others. What did he do?",
   "answer": "The mathematician made a small fence around himself and declared himself to be on the outside."
  },
  {
   "title": "Birbal the Wise - XI",
   "desc": "Emperor Akbar once ruled over India. He was a wise and intelligent ruler, and he had in his court the Nine Gems, his nine advisors, who were each known for a particular skill. One of these Gems was Birbal, known for his wit and wisdom. The story below is one of the examples of his wit. Do you have it in you to find out the answer?\nOne day a scholar came to the court of Emperor Akbar and challenged Birbal to answer his questions and thus prove that he was as clever as people said he was.\nHe asked Birbal: \"Would you prefer to answer a hundred easy questions or just a single difficult one?\"\nBoth the emperor and Birbal had had a difficult day and were impatient to leave.\n\"Ask me one difficult question,\" said Birbal.\n\"Well, then tell me,\" said the man, \"which came first into the world, the chicken or the egg?\"\n\"The chicken,\" replied Birbal, very confidently.\n\"How do you know?\" asked the scholar, a note of triumph in his voice.\nWhat did Birbal answer to this?",
   "answer": "Birbal told the scholar, \"We had agreed you would ask only one question and you have already asked it\" and he and the emperor walked away leaving the scholar gaping!"
  },
  {
   "title": "What Song?",
   "desc": "A man is sitting in a pub feeling rather poor. He sees the man next to him pull a wad of £50 notes out of his wallet.\nHe turns to the rich man and says to him,\n\"I have an amazing talent; I know almost every song that has ever existed.\"\nThe rich man laughs.\nThe poor man says, \"I am willing to bet you all the money you have in your wallet that I can sing a genuine song with a lady's name of your choice in it.\"\nThe rich man laughs again and says, \"OK, how about my daughter's name, Joanna Armstrong-Miller?\"\nThe rich man goes home poor. The poor man goes home rich.\nWhat song did he sing?",
   "answer": "\"Happy Birthday\"\nThis song can be sung with anyone's name in it.",
   "hint": "It is a genuine song that almost everyone should know."
  },
  {
   "title": "An Upside-Down Spotted Striped Box",
   "desc": "Follow these steps and see if you can figure this out.\n1) Get a brown, cardboard box.\n2) Get purple, orange, and turquoise paints.\n3) Paint the box orange.\n4) Paint on purple spots.\n5) Paint on turquoise stripes.\n7) Turn it upside down.\n8) Lie on your side.\nWhat is missing from this sequence?",
   "answer": "Step 6!",
   "hint": "The answer isn't to get a paintbrush, wait for it to dry, paint the bottom, or something similar. Remember, this is a TRICK teaser... :)"
  },
  {
   "title": "The Club",
   "desc": "A man wanted to get into a members only club so he hid and watched the guard at the door of the club house. The guard said a number to each member as they approached, and the member would respond with a number of their own. If the member responded with the correct number they were let in. If they responded incorrectly they were thrown out. One member came up to the door, the guard said twelve, and the member responded with six and was let in. Another member came to the door, the guard said six and the member responded with three and was let in. Believing he had heard enough, the reject went up to the guard. The guard said ten, and the reject said five, but was not let in. What should the reject have said?",
   "answer": "He should have said three, the number of letters in the number the guard said."
  },
  {
   "title": "Standard Sequence",
   "desc": "Given the word STANDARD, take away two letters and add three digits to make a logical sequence.",
   "answer": "Take away the A's to leave ST ND RD.\nThen add 1, 2, and 3: 1ST 2ND 3RD.",
   "hint": "Remove both A's. Do the remaining letters look familiar?"
  },
  {
   "title": "Young Archer",
   "desc": "A duke was hunting in the forest with his men-at-arms and servants when he came across a tree. Upon it, archery targets were painted and smack in the middle of each was an arrow. \"Who is this incredibly fine archer?\" cried the duke. \"I must find him!\"\nAfter continuing through the forest for a few miles he came across a small boy carrying a bow and arrow. Eventually the boy admitted that it was he who shot the arrows plumb in the center of all the targets. \"You didn't just walk up to the targets and hammer the arrows into the middle, did you?\" asked the duke worriedly. \"No my lord. I shot them from a hundred paces. I swear it by all that I hold\nholy.\" \"That is truly astonishing,\" said the duke. \"I hereby admit you into my service.\"\nThe boy thanked him profusely. \"But I must ask one favor in return,\" the duke continued. \"You must tell me how you came to be such an outstanding shot.\"\nHow'd he get to be such a good shot?",
   "answer": "The boy shot the arrow, THEN painted the circle around it."
  },
  {
   "title": "Strange Recipe",
   "desc": "Susan needed to go to the store to buy some ingredients to cook with. She started writing them down:\nButter\nMilk\nEggs\nBaking Soda\nCashews\nOranges\nVinegar\nLemon Juice\nWhat was Susan making?",
   "answer": "A shopping list."
  },
  {
   "title": "Birbal the Wise - X",
   "desc": "Emperor Akbar once ruled over India. He was a wise and intelligent ruler, and he had in his court the Nine Gems, his nine advisors, who were each known for a particular skill. One of these Gems was Birbal, known for his wit and wisdom. The story below is one of the examples of his wit. Do you have it in you to find out the answer?\nOne day the Emperor Akbar startled his courtiers with a strange question.\n\"If somebody pulled my moustache, what sort of punishment should be given to him?\" he asked.\n\"He should be flogged!\" said one courtier.\n\"He should be hanged!\" said another.\n\"He should be beheaded!\" said a third.\n\"And what about you, Birbal?\" asked the emperor. \"What do you think would be the right thing to do if somebody pulled my whiskers?\"\n\"He should be given sweets,\" said Birbal.\n\"Sweets?\" gasped the other courtiers.\nWhy do you think Birbal gave such a strange answer to the Emperor's strange question?",
   "answer": "Birbal continued, \"Yes, sweets, because the only one who would dare pull His Majesty's moustache is a small child such as your grandson.\"\nBirbal said this because he knew no adult person, however close to the Emperor, would get away with something like that, as a moustache was a symbol of power and not something to be taken lightly.\nSo pleased was the emperor with the answer that he took off his necklace and gave it to Birbal as a reward for his quick wit."
  },
  {
   "title": "Third, Fourth, Fifth",
   "desc": "David showed a piece of paper to Kenneth, while covering the top part of it with his hand. The visible portion below his hand read as follows:\nTHIRD\nFOURTH\nFIFTH\nSIXTH\nSEVENTH\nEIGHTH\nNINTH\nTENTH\nDavid said, \"My hand is covering two words, the first two words in this list of ten words. The list follows a completely and indisputably logical sequence. None of the words are repeated. I'll bet you $50 that you cannot tell me what those two words are on your first try. You can say the two words in either order.\"\nKenneth could not see any reason not to accept this wager, and said \"First and second\" for the easy $50 win. However, after David moved his hand away, Kenneth realized he had lost, and indeed, there was not even an argument to be made. What were the two hidden words?",
   "answer": "\"Whole\" and \"Half.\" The obvious idea is that the list is of ordinal numbers. However, it is actually a list of the names of the inverse fractions of the natural numbers. That is, 1/1, 1/2, 1/3, etc."
  },
  {
   "title": "3, 76, 49, 24, 59, 36",
   "desc": "What is the next number?\n3, 76, 49, 24, 59",
   "answer": "36\nLook at the title!",
   "hint": "This isn't in the series category."
  },
  {
   "title": "Darts, Pt II",
   "desc": "Boudreaux, a master dartsman, was bragging to his bar mates that he was such a consummate player, he could hit the dartboard in any location at will.\n\"I'll wager a hundred dollars that, no matter what position you name on the board, I'll be able to hit it.\"\nThibedeaux, tired of Boudreaux's windbaggery, shouted out an answer.\nBoudreaux stammered for a few moments and at first refused to pay. The other bar patrons, however, made sure he held up his end of the wager. Boudreaux slammed a hundred dollar bill on the counter and stormed out.\nWhere on the dartboard did Thibedeaux suggest?",
   "answer": "The back of the board."
  },
  {
   "title": "-ectomy",
   "desc": "Removing an appendix is called an appendectomy, removing tonsils is called a tonsillectomy. What is it called when they remove a growth from your head?",
   "answer": "A haircut"
  },
  {
   "title": "3/7 Chicken",
   "desc": "What is 3/7 chicken, 2/3 cat and 1/2 goat?",
   "answer": "Chicago.\n3/7 chicken= CHI\n2/3 cat = CA\n1/2 goat= GO"
  }
 ]
}