{
 "enigmas": [
  {
   "title": "Odd Two Out Too",
   "desc": "In this teaser, you have to find the odd ones out in the groups of words. BUT WAIT! There's a catch. Each group of words has TWO words which do not belong. Can you find them both?\nEXAMPLE:\nLily - Jane - Tulip - Rose\nJane does not belong as it's the only one which is not a flower.\nTulip also does not belong because it's the only one which is not a girl's name.\nYou're on your own for the rest!\n1. Dodge - Ford - Lincoln - Hoover\n2. King - Earl - Knight - Bishop\n3. Yellow - Green - Dead - Black",
   "answer": "1. Hoover does not belong as it's the only one which is not a car manufacturer. Dodge does not belong as it's the only one which is not the last name of a President of USA.\n2. Bishop does not belong as it's the only one which is not a class of nobility. Earl does not belong as it's the only one which is not a Chess piece.\n3. Dead does not belong as it's the only one which is not a color. Green does not belong as it's the only one which is not the name of a sea."
  },
  {
   "title": "Christmas Time",
   "desc": "Can you decipher these common Christmas Carols?\n1. Happiness to the Global Ecosystem\n2. Small male percussionist\n3. I am experiencing nocturnal visions of a colorless holiday\n4. Festoon the Corridors\n5. A Non-summer fairytale area\n6. Oh holiday conifer\n7. Ten plus two twenty-four hour periods of holiday festivity\n8. Hey tiny city in Israel\n9. In a remote location in a barn stall",
   "answer": "1. Joy to the World\n2. Little Drummer Boy\n3. I'm Dreaming of a White Christmas\n4. Deck the Halls\n5. Winter Wonderland\n6. Oh Christmas Tree\n7. 12 Days of Christmas\n8. Oh Little Town of Bethlehem\n9. Away in a Manger"
  },
  {
   "title": "Fabled Classifieds",
   "desc": "The below classified ads were spotted in this week's newspaper. They all share a common feature.\nWhat is that common feature, and who is each ad's author?\n1. Crimson cloaked young female seeks protection services. Task include food courier service. Outdoor experience a plus. Inquire with grandmother.\n2. For Sale: 20 mattresses. Like new, used only once. Each shares common irregularity, not discernible by most. Make offer.\n3. For Sale: Two adjacent lots. Located near new brick housing. Land can be cleared of debris upon request. Will build to suit.\n4. Debris removal services required. Have large amounts of vegetation that requires cut up and removal. Please call for details. Gold or specialty hybrid seeds available for trade.\n5. Lost: 1 Slipper, translucent in color. Sentimental value. Last seen, yesterday before midnight. Please leave message with stepmother.",
   "answer": "All the ads are all from fairy tale characters.\n1. Grandmother (Little Red Riding Hood)\n2. The Old Queen (Princess & the Pea)\n3. The 3rd little pig (3 Little Pigs)\n4. Jack's widowed mom (Jack and the Beanstalk)\n5. Cinderella's stepmother (Cinderella)"
  },
  {
   "title": "Myths and Legends",
   "desc": "Can you pick the god from the list provided that will complete this group?\nZeus, Hephaestus, Gaea, ?\nChoose from: Dionysus, Athena, Hermes, Poseidon, Aphrodite",
   "answer": "Poseidon finishes the group. These Greek gods were associated with the four elements (air, fire, earth and water, respectively).",
   "hint": "What are these gods associated with?"
  },
  {
   "title": "I Must Not Fear...",
   "desc": "A phobia is an irrational fear or hatred of a specific thing or situation which compels one to avoid it despite awareness and reassurance that the object or situation is not dangerous. Listed below are the names and definitions of six phobias. Five are real phobias documented in psychology journals, while one is an imposter. Can you determine which one from the list below is not a real phobia?\nTrichopathophobia - Fear of hair\nPentheraphobia - Fear of mother-in-law\nAibohphobia - Fear of Palindromes\nDoraphobia - Fear of fur or skins of animals\nLogizomechanophobia - Fear of computers.\nOnomatophobia- Fear of hearing a certain word or of certain names.",
   "answer": "Aibohphobia is not a real, documented phobia; it is actually a joke started on the Internet. It has not appeared in any documented psychology journal. The joke, of course, is that the word Aibohphobia is a palindrome.\nThe title is part of a quote on fear from the book Dune, by Frank Herbert.",
   "hint": "Look at the words carefully."
  },
  {
   "title": "Movie Alternates (Medium)",
   "desc": "Here are more movie alternates, but this time they are a bit more challenging.\nUse synonyms of the following phrases to decode popular movie titles.\n1.) Razors of Honor\n2.) Wonder-male Comes Back\n3.) Ruler of the Bands\n4.) Endless Light of the Unstained Head\n5.) Super Quartet\n6.) Mandibles",
   "answer": "1.) Blades of Glory\n2.) Superman Returns\n3.) Lord of the Rings\n4.) Eternal Sunshine of the Spotless Mind\n5.) Fantastic Four\n6.) Jaws"
  },
  {
   "title": "Who Said This?",
   "desc": "The following are humorous quotes from famous people in history.\nCan you match the quotes in Part 1 with the person who said it in Part 2? Good luck!\nPart 1:\n1. \"Common looking people are the best in the world: that is the reason the Lord makes so many of them.\"\n2. \"I like pigs. Dogs look up to us. Cats look down at us. Pigs treat us as equals.\"\n3. \"Put your hand on a hot stove for a minute, and it seems like an hour. Sit with a pretty girl for an hour, and it seems like a minute. THAT'S relativity.\"\n4. \"A classic is something that everybody wants to have read and nobody wants to read.\"\n5. \"Live in such a way that you would not be ashamed to sell your parrot to the town gossip.\"\n6. \"God heals and the doctor takes the fee.\"\nPart 2:\nAlbert Einstein.\nWill Rogers.\nAbraham Lincoln.\nBenjamin Franklin.\nWinston Churchill.\nMark Twain.",
   "answer": "1. Abraham Lincoln. \"Common looking people are the best in the world: that is the reason the Lord makes so many of them.\"\n2. Winston Churchill. \"I like pigs. Dogs look up to us. Cats look down at us. Pigs treat us as equals.\"\n3. Albert Einstein. \"Put your hand on a hot stove for a minute, and it seems like an hour. Sit with a pretty girl for an hour, and it seems like a minute. THAT'S relativity.\"\n4. Mark Twain. \"A classic is something that everybody wants to have read and nobody wants to read.\"\n5. Will Rogers. \"Live in such a way that you would not be ashamed to sell your parrot to the town gossip.\"\n6. Benjamin Franklin. \"God heals and the doctor takes the fee.\""
  },
  {
   "title": "Weak Memory",
   "desc": "\"Uncle Jimmy, we're studying Norse mythology and I keep forgetting some of the names, can you help?\" Andrew asked.\n\"Certainly,\" Jimmy replied, \"let's pick a few to start with: Odin, his wife Frigg, Thor, and Tyr. You really already know these names, or at least the Anglo-Saxon equivalent.\nWoden is the Anglo-Saxon equivalent of Odin, the wise, one-eyed, chief god.\nFrige is the Anglo-Saxon equivalent of Frigg, the goddess of clouds and sky.\nThunor is the Anglo-Saxon equivalent of Thor, the god of thunder.\nTiw is the Anglo-Saxon equivalent of Tyr, the god of war and battle.\"\n\"Sorry, but those names don't seem any more familiar,\" Andrew protested.\n\"What if I told you those four names are related to the sun, the moon, and the planet Saturn?\"\n\"What? That's even more confusing.\"\n\"Final clue, they are the basis of a naming system that we use every day.\"\nIn what way are these names commonly used about which Andrew should be aware?",
   "answer": "They are the basis for our names of the days of the week.\nSunday - Sunnandaeg - Sun's day\nMonday - Monandaeg - Moon's day\nTuesday - Tiwesdaeg - Tiw's day\nWednesday - Wodnesdaeg - Woden's day\nThursday - Thunresdaeg - Thunor's day\nFriday - Frigedaeg - Frige's day\nSaturday - Saeternesdaeg - Saturn's day",
   "hint": "They are names that we use every DAY. Here is the list in order:\nthe sun, the moon, Tiw, Woden, Thunor, Frige, and Saturn."
  },
  {
   "title": "A Glass of Jameson Anyone?",
   "desc": "Two professors were sitting in front of an open fire at the local university's elite Professor's Club. They were chatting about some of their new classes. During the course of their conversation, one of the professors asked the other if he would like to sample some fine Irish Whiskey while they talked.\n\"Absolutely! That would be splendid!\"\n\"Waiter! Bring me a bottle of your finest Irish Whiskey please\", called the Professor.\n\"Certainly sir\", replied the waiter.\nA few minutes later, the waiter returned and said, \"Here you go sir. This bottle of 'Jameson' is one of Ireland's best single malt grain whiskeys. I hope you both enjoy it!\"\n\"Thank you waiter. I'm sure we will. Can you let me look at the bottle please before you go?\"\nThe waiter passed the bottle to the Professor. The label read:\n\"Jameson Genuine Irish Single Malt Grain Whisky\".\nWithout opening the lid of the bottle or tasting, smelling or examining its contents, the Professor became very angry with the waiter saying, \"This is NOT genuine Irish whiskey. It is a fraud and absolute rubbish! Take it back!\"\nBy simply reading the label, and without smelling, examining or tasting the fluid first, how did the Professor know that the contents of the bottle was not Irish whiskey?",
   "answer": "The Professor knew it was not really Irish Whiskey because of the difference in how the Irish spell \"whiskey\" (with an \"e\") and how the Scottish spell it - \"whisky\".\nThe label read: \"Jameson Genuine Irish Single Malt Grain Whisky\".\nA true bottle of Irish whiskey would have read: \"Jameson Genuine Irish Single Malt Grain Whiskey\".\nThere appears to be no known reason, legal or otherwise why this difference exists."
  },
  {
   "title": "Animal Groups",
   "desc": "As you may know, a group of fish is called a \"school\", a group of lions is called a \"pride\", and a group of seagulls is called a \"flock\". Some are a little more unusual. See if you can guess what animals belong to the following groups:\nCrash\nExaltation\nMob\nMurder\nParliament\nPod\nSounder",
   "answer": "Crash - Rhinoceros\nExaltation - Lark\nMob - Kangaroo\nMurder - Crow\nParliament - Owl\nPod - Whale\nSounder - Pig/Hog"
  },
  {
   "title": "Liger?",
   "desc": "Once, there was a lovesick tiger who fell in love with a lovely lioness. However, her pride rejected him, and they were not allowed to be together because he was different.\nHeart sickness and grief caused the lovely lioness to lose all of her fur. Even though it was a sad sight, the tiger was overjoyed! Now he would shave off all of his fur. Then he could pretend to be a large lion and be with his beloved.\nUnfortunately, they did not get to live happily ever after! His plan failed. Even with his fur gone, everyone could tell he was a tiger.\nIgnoring any obvious size differences, how did the pride know that he was obviously still a tiger?",
   "answer": "Tigers have striped skin as well as striped fur",
   "hint": "The answer is only skin-deep!"
  },
  {
   "title": "The Old Monk and the Staircase",
   "desc": "Construction of a stronger and more massive bell tower for the monastery to replace the one destroyed during the last civil strife with a neighboring lord was well underway when the old Monk visited the site. The Abbot showed the Monk the drawings and model for the three-bell tower. The Monk was impressed until he stood where the bell chamber would be and saw the spiral staircase in this medieval bell tower running the wrong direction (counterclockwise).\n\"The staircase direction must be changed,\" said the Old Monk. The Abbot looked at the staircase and agreed. Why?",
   "answer": "Spiral staircases in medieval castles, towers and Keeps were run clockwise. This is because all knights used to be right-handed. When the intruding army would climb the stairs they would not be able to use their right hand, which was holding the sword because of the difficulties of climbing the stairs, giving clear advantage to the defenders. Many of the orders of clergy had military training in order to defend monasteries and Abbeys during the middle ages.\nLeft-handed knights would have had no troubles, except left-handed people could never become knights because it was assumed that they were descendants of the devil.",
   "hint": "Left-handed people, it was assumed, were descendants of the devil."
  },
  {
   "title": "Death Cured?",
   "desc": "My great-grandmother was exceptional from first to last. She was the first baby born in the state in 1851. She was almost the first centenarian in the family, but she died in 1950, one day before her 100th birthday.\nThe cause of her death was not unusual; thousands of people died of the same cause that year and also in previous years. Her death was exceptional because she was the last person ever to die from that cause in the United States.\nWhat was the cause of death?",
   "answer": "Old age.\nNo American has died of old age since 1951. Old age was \"cured\" at a Public Health Conference on Records and Statistics. All state and federal agencies were ordered to adopt a standard list of 130 contributing and underlying causes of death. In 1951, the list deleted \"old age\" as a cause of death.\nThere is still some debate over whether old age is an appropriate cause of death. If someone dies peacefully in their sleep at age 95, one or several organs may have shut down, but isn't the underlying cause old age?",
   "hint": "Her age isn't important, but the date is. If she had lived just one more day, she wouldn't have died from that cause. No major disease was cured in 1951, but it would have been illegal to die from that cause."
  },
  {
   "title": "Country Scramble",
   "desc": "Can you unscramble the countries in Part 1 and match them with the appropriate fact about them in Part 2? And your answer is?\nPart 1\n1. HCAIN\n2. GRIINAE\n3. PAJNA\n4. SUKTROOAEH\n5. MIKUDITDNENGO\n6. HUFAIORSACT\n7. MNAAORI\nPart 2\n1. This is the world's most populous country.\n2. The capital of this country is Abuja.\n3. This is the only country to ever suffer an attack with atomic weapons.\n4. The capital of this country is Seoul.\n5. This country is a great industrial power despite the fact that it must import many resources.\n6. The capital of this country is Pretoria.\n7. Dracula's home, Transylvania, is in this country.",
   "answer": "1. China: This is the world's most populous country.\n2. Nigeria: The capital of this country is Abuja.\n3. Japan: This is the only country to ever suffer an attack with atomic weapons.\n4. South Korea: The capital of this city is Seoul.\n5. United Kingdom: This country is a great industrial power despite the fact that it must import many resources.\n6. South Africa: The capital of this country is Pretoria.\n7. Romania: Dracula's home, Transylvania, is in this country."
  },
  {
   "title": "Model Modification 4",
   "desc": "Have you ever been stuck in traffic, staring at the vehicle ahead of you?\nDid you notice the make and model? Now you can use that to your advantage.\nEach clue below takes the model name of a vehicle and modifies it to form a normal English word.\nAny letters in quotes must be added to the model name (either before, after, or inside).\nSee how many you can figure out.\nExample: Don't be greedy! Inserting \"PERABU\" into this Plymouth model is just too much.\nAnswer: SU-PERABU-NDANCE, a modified Plymouth SUNDANCE. A \"superabundance\" is an excessive amount.\n1. You may get a hole in one of these Volkswagen models, but you will be beaten backwards.\n2. Insert \"AT\" into this Ford model to establish the validity of your will.\n3. You must insert an \"ITIM\" in this Subaru model to be in compliance with the law.\n4. This Mitsubishi model is a summary, but it needs an \"E\" to be strictly correct.\n5. Following this Toyota model with \"RY\" will lead you to a conclusion.\n6. Adding \"BLE\" to this Oldsmobile model is something we can definitely do.\n7. Inserting a \"C\" into this Honda model will make it impossible to occur.",
   "answer": "1. FLOG, a modified (backwards) Volkswagen GOLF. To \"flog\" is to beat; a hole-in-one is a perfect shot in golf.\n2. PROB-AT-E, a modified Ford PROBE. A \"probate\" is the process of proving that a will is authentic.\n3. LEG-ITIM-ACY, a modified Subaru LEGACY. \"Legitimacy\" refers to conforming with the law.\n4. PRECIS-E, a modified Mitsubishi PRECIS. To be \"precise\" is to be exactly correct; a \"precis\" is a summary.\n5. COROLLA-RY, a modified Toyota COROLLA. A \"corollary\" is something easily shown based on what is already proved.\n6. ACHIEVA-BLE, a modified Oldsmobile ACHIEVA. Anything that can be done is \"achievable\".\n7. PRE-C-LUDE, a modified Honda PRELUDE. To \"preclude\" is to make impossible or to prevent from occurring.",
   "hint": "Here is a list of models; only some are needed.\nAchieva, Alero, Beetle, Civic, Colt, Corolla, Escape, Expo, Fit, Forester, Golf, Integra, Legacy, Neon, Precis, Prelude, Prius, Probe, Quest, Scorpio, Tempo"
  }
 ]
}